var global= new Object;
global.langs=new Array;
global.noncom="[ยังไม่แล้วเสร็จ]";
global.categoryName=new Array("เตปิฏก - อฏฺฐกถา - ฏีกา","เตปิฏกํ","อฏฺฐกถา","ฏีกา" ,"วินยลกฺขณํ","สุตฺตนฺตลกฺขณํ","อภิธมฺมลกฺขณํ","อญฺญคนฺโถ","พระไตรปิฎกแปล","อรรถกถาแปล","ฏีกาแปล");
//เมนูหลัก
	global.langs["deIntroduction"]	="<div align=center><b>:: พุทโธ ::</b></div>เราจะยิ้มรื่นเริงเบิกบานใจ เมื่อเราได้นึกถึงคำว่า \"พุทโธ\"<img src=images/emoticon200.gif >";
	global.langs["Home"]	="อารัมภบท";
	global.langs["deHome"]	="<div align=center><b>:: สะเตมี : อารัมภบท ::</b></div>๏ ไปหน้าแรกของสะเตมี. <br>๏ อิโต สเตมิโน ปฐมภูมึ อุปคมถ. ";
	global.langs["ArrayIndex"]	="อนุกรม";
	global.langs["deArrayIndex"]	="<div align=center><b>:: สะเตมี : อนุกรม ::</b></div>๏  สารบัญพระไตรปิฎก, สารานุกรม - พุทธสาระ, พจนานุกรม - คำศัพท์, ปทานุกรม - ลำดับคำ.<br>๏ อิโต คนฺถสฺส นานานุกมนํ ทสฺเสถ.";
	global.langs["Search"]	="ค้นพระไตรปิฎก";
	global.langs["SearchSatemy"]	="สะเตมี : ค้นพระไตรปิฎก";
	global.langs["deSearch"]	="<div align=center><b>:: สะเตมี : ค้นพระไตรปิฎก ::</b></div>๏  หน้าแรกของ ระบบ ค้นพระไตรปิฎก.<br>๏ อิโต โอโลกนุปกรณสฺส ปฐมภูมึ อุปคมถ.";
	global.langs["GuideBook"]	="คู่มือ";
	global.langs["deGuideBook"]	="<div align=center><b>:: สะเตมี : คู่มือ ::</b></div>๏ สะเตมี : คู่มือ วิธีใช้สะเตมี .<br>๏ อิโต สเตมิยา วิตฺถารนยํ โอโลกนวิธึ อุคฺคณฺหาถ.";
	//ArrayContent
	global.langs["Content"]	="สารบัญ";
	global.langs["deContent"]	="<div align=center><b>:: สะเตมี : อนุกรม : สารบัญ ::</b></div>๏  ระบบ รายชื่อ หนังสือ ในสะเตมี. ทั้ง<b> สะเตมี : บาลี - ไทย</b> และ <b> สะเตมี : เรียนพระไตรปิฎก</b> พร้อมรายชื่อเรื่อง ของแต่ละเล่ม.<br>๏ อิโต "+global.categoryName[0]+"ยํ คนฺถสฺส คนฺถสฺส มาติกํ ทสฺเสถ.";
	global.langs["DhammaPedia"]	="สารานุกรม";
	global.langs["deDhammaPedia"]	="<div align=center><b>:: สะเตมี : อนุกรม : สารานุกรม ::</b></div>๏  ระบบ สารานุกรม ธรรมะออนไลน์ แหล่งรวบรวม เรื่องน่ารู้ นานาสาระ ในพระไตรปิฎก อรรถกถา ฏีกา และ เรื่องราวต่าง ๆ ทาง พระพุทธศาสนา.<br>๏ อิโต "+global.categoryName[0]+"ย ปกิณฺณกธมฺมานุกมํ ทสฺเสถ.";
	global.langs["Dictionary"]	="พจนานุกรม";
	global.langs["deDictionary"]	="<div align=center><b>:: สะเตมี : อนุกรม : พจนานุกรม ::</b></div>๏  ระบบ พจนานุกรม ลำดับ คำศัพท์ พร้อมคำแปล [แปลเท่ากับ จำนวนศัพท์ ที่พบ ในพระไตรปิฎก อรรถกถา ฏีกา].<br>๏ อิโต "+global.categoryName[0]+"ย อภิธานานุกมํ ทสฺเสถ.";
	global.langs["Glossary"]	="ปทานุกรม";
	global.langs["deGlossary"]	="<div align=center><b>:: สะเตมี : อนุกรม : ปทานุกรม ::</b></div>๏  ระบบ ปทานุกรม ลำดับคำที่พบ ในพระไตรปิฏก อรรถกถา ฏีกา พร้อมลิงค์ สู่หน้าที่พบ ศัพท์นั้น.<br>๏ อิโต "+global.categoryName[0]+"ย ปทานานุกมํ ทสฺเสถ.";
	//อนุกฺกม
	global.langs["sadda"]="ประมวลศัพท์";
	global.langs["dhamma"]="ประมวลธรรม";
	global.langs["eth"]="อังกฤษ - ไทย";
	global.langs["the"]="ไทย - อังกฤษ";
	global.langs["MeanToo"]="ค้นความหมายด้วย";
//หน้าค้นหา
	//สะเตมี : บาลี-ไทย
	global.langs["TPaliThai"]	="สะเตมี : บาลี-ไทย";
	global.langs["deTPaliThai"]	="<div align=center><b>:: สะเตมี : บาลี-ไทย ::</b></div>๏ ระบบ ค้นพระไตรปิฎก อรรถกถา ฏีกา บาลี-ไทย ฉบับสังคายนา ครั้งที่ 6 <br>๏ อิโต ฉฏฺฐสงฺคายนาย ปาฬิ - อฏฺฐกถา - ฏีกาย โอโลกนุปกรณํ อุปคมถ.";
	global.langs["TPaliThaiSendFrame"]	="<a href=index.php?OMode=PI&bdr=off target=parent>สะเตมี : บาลี-ไทย</a>";
	global.langs["TLernSendFrame"]	="<a href=index.php?OMode=TI&bdr=off target=parent>สะเตมี : เรียนพระไตรปิฎก</a>";
	global.langs["TPaliThaiSearchFrame"]	="สะเตมี : บาลี-ไทย : ค้นหา";
	global.langs["deTThaiPaliBook"]	="<div align=center><b>:: หมวดคัมภีร์หลัก ::</b></div>หมวดคัมภีร์ ในระบบค้นสะเตมี : บาลี-ไทย มีดังนี้ :-<br>&nbsp&nbsp&nbsp๏ 1. เตปิฏกํ<br>&nbsp&nbsp&nbsp๏ 2. อฏฺฐกถา<br>&nbsp&nbsp&nbsp๏ 3. ฏีกา.<br>&nbsp&nbsp&nbsp๏ 4. วินยลกฺขณํ.<br>&nbsp&nbsp&nbsp๏ 5. สุตฺตนฺตลกฺขณํ.<br>&nbsp&nbsp&nbsp๏ 6. อภิธมฺมลกฺขณํ.<br>&nbsp&nbsp&nbsp๏ 7. อญฺญคนฺโถ.<br>&nbsp&nbsp&nbsp๏ 8. พระไตรปิฎก แปล.<br>&nbsp&nbsp&nbsp๏ 9. อรรถกถา แปล.<br>&nbsp&nbsp&nbsp๏ 10. ฏีกา แปล.<br>&nbsp&nbsp&nbsp๏ 11. ปกรณ์กลุ่ม วินัยลักษณะ แปล.<br>&nbsp&nbsp&nbsp๏ 12.ปกรณ์กลุ่ม สุตตันตลักษณะ แปล.<br>&nbsp&nbsp&nbsp๏ 13. ปกรณ์กลุ่ม อภิธรรมลักษณะ แปล.<br>&nbsp&nbsp&nbsp๏ 14.ไวยากรณ์บาลีและปกรณ์อื่น ๆ.<br>อนึ่ง มีบางหมวดยังไม่ได้เปิดให้ใช้ ในรุ่นนี้ เนื่องจากยังไม่มีต้นฉบับ หรือยังดำเนินการไม่แล้วเสร็จ. ";
	//สะเตมี : เรียนพระไตรปิฎก
	global.langs["TLearn"]	="สะเตมี : เรียนพระไตรปิฎก";
	global.langs["deTLearn"]	="<div align=center><b>:: สะเตมี : เรียนพระไตรปิฎก ::</b></div>๏ ระบบค้นพระไตรปิฎก - อรรถกถาแปล ฉบับ 91 เล่ม โดยมหามกุฏราชวิทยาลัย พร้อมวิสุทธิมรรค และปกรณ์สำคัญอื่น.<br>๏ อิโต เอกนวุติยา ทยฺรฏฺฐภาสาปริวตฺติยเตปิฏกสฺส โอโลกนุปกรณํ อุปคมถ.";
	//ทุกระบบ
	global.langs["SearchComplex"] = "สะเตมี : ทุกระบบ";
	global.langs["deSearchComplex"]="<div align=center><b>:: สะเตมี : ทุกระบบ ::</b></div>๏ ระบบ ค้นพระไตรปิฎก ทุกระบบ ทั้ง สะเตมี : บาลี - ไทย และ สะเตมี : เรียนพระไตรปิฎก.<br>๏ อิโต สพฺพํ โอโลกนุปกรณํ อุปคมถ.";
	
	//เมนูสำหรับค้น
	global.langs["SearchForm"]	="พิมพ์คำค้น";
	global.langs["deSearchForm"]	="<div align=center><b>:: พิมพ์คำค้น ::</b></div>๏ พิมพ์คำ ที่ท่านต้องการ ค้นหา. <br>๏ อิโต โอโลกนกามวจนํ ลิเขยฺยาถ.";
	global.langs["deBookSelectForm"]	="<div align=center><b>:: เลือกประเภทหนังสือ ::</b></div>๏ เลือก หมวดหนังสือที่ต้องการ. <br>๏ อิโต คนฺถสฺส นิกายํ ปฏิคณฺเหยฺยาถ.";
	global.langs["deSendForm"]	="<div align=center><b>:: ฝากส่ง ::</b></div>๏ ส่ง คำค้น และ หมวดหนังสือ ที่ท่านต้องการ ไปยังระบบค้นหา. <br>๏ อิโต โอโลกนํ อารเภยฺยาถ.";
	global.langs["deSubmitForm"]	="<div align=center><b>:: เริ่มค้น ::</b></div>๏ เริ่มการค้นหา (ต้องพิมพ์คำค้น และเลือกเล่ม ก่อนทุกครั้ง). <br>๏ อิโต โอโลกนํ อารเภยฺยาถ.";
	global.langs["deBookCheckboxForm"]	="<div align=center><b>:: ติ๊ก ::</b></div>๏ ท่านสามารถ ติ๊กเครื่องหมายถูก เลือกเล่ม ที่นี่ เฉพาะเล่มที่ท่านต้องการ เพื่อผลลัพธ์ที่เร็ว และตรงตามความต้องการยิ่งขึ้น.<br>๏ อิโต คนฺถํ ปฏิคณฺเหยฺยาถ.";
	global.langs["deResultTypeForm"]	="<div align=center><b>:: รูปแบบผลลัพธ์ ::</b></div>เลือกรูปแบบผลลัพธ์ที่นี่ :-<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;๏ <b>บางส่วน</b> <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; โปรแกรมจะแสดง เฉพาะผลบางส่วน ของย่อหน้า หรือ หน้า มี่พบคำที่ต้องการ.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;๏ <b>บางส่วนพลัส(บางส่วน+)</b> <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; สามารถกำหนด จำนวนอักษร ก่อนหน้า และหลัง ของผล การค้นแบบบางส่วน ได้ด้วยหัวข้อนี้.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;๏ <b>ย่อหน้า - หน้า</b> <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; แสดงผลการค้น ทั้งย่อหน้าที่พบ คำที่ต้องการ หรือ ทั้งหน้านั้น";

//คำอธิบายหมวดปกรณ์
	//สะเตมี : บาลีไทย
	global.langs["PP"]	="เตปิฏกํ";
	global.langs["AP"]	="อฏฺฐกถา";
	global.langs["TP"]	="ฏีกา";
	global.langs["VinayaPrecisP"]	="วินยลกฺขณํ";
	global.langs["SuttantaPrecisP"]	="สุตฺตนฺตลกฺขณํ";
	global.langs["AbhidhammaPrecisP"]	="อภิธมฺมลกฺขณํ";
	global.langs["OtherBook"]	="อญฺญคนฺโถ";
	global.langs["PT"]	="พระไตรปิฎกแปล";
	global.langs["AT"]	="อรรถกถาแปล";
	global.langs["TT"]	="ฏีกาแปล";
	global.langs["VinayaPrecisT"]	="";
	global.langs["SuttantaPrecisT"]	="";
	global.langs["AbhidhammaPrecisT"]	="";
	global.langs["dePP"]	="<div align=center><b>:: เตปิฏกํ ::</b></div>๏ หนังสือหมวด พระไตรปิฎก ภาษาบาลี อักษรไทย ฉ. ฉัฏฐสังคายนา.<br>๏ ฉฏฺฐสงฺคายนาย ทยฺยภาสาวณฺโณ เตปิฏกคนฺโถ.";
	global.langs["deAP"]	="<div align=center><b>:: อฏฺฐกถา ::</b></div>๏ หนังสือหมวด อรรถกถา ภาษาบาลี อักษรไทย ฉ. ฉัฏฐสังคายนา.<br>๏ ฉฏฺฐสงฺคายนาย ทยฺยภาสาวณฺโณ อฏฺฐกถาคนฺโถ.";
	global.langs["deTP"]	="<div align=center><b>:: ฏีกา ::</b></div>๏ หนังสือหมวด ฏีกา ภาษาบาลี อักษรไทย ฉ. ฉัฏฐสังคายนา.<br>๏ ฉฏฺฐสงฺคายนาย ทยฺยภาสาวณฺโณ ฏีกาคนฺโถ.";
	global.langs["deVinayaPrecisP"]	="<div align=center><b>:: วินยลกฺขณํ ::</b></div>๏ หนังสือหมวด สรุปความ พระวินัย ภาษาบาลี อักษรไทย ฉ. ฉัฏฐสังคายนา.<br>๏ ฉฏฺฐสงฺคายนาย ทยฺยภาสาวณฺโณ วินยสงฺเขป - สงฺคหคนฺโถ.";
	global.langs["deSuttantaPrecisP"]	="<div align=center><b>:: สุตฺตนฺตลกฺขณํ ::</b></div>๏ หนังสือหมวด สรุปความ พระสูตร ภาษาบาลี อักษรไทย ฉ. ฉัฏฐสังคายนา.<br>๏ ฉฏฺฐสงฺคายนาย ทยฺยภาสาวณฺโณ สุตฺตนฺตสงฺเขป - สงฺคหคนฺโถ.";
	global.langs["deAbhidhammaPrecisP"]	="<div align=center><b>:: อภิธมฺมลกฺขณํ ::</b></div>๏ หนังสือหมวด สรุปความ พระอภิธรรม ภาษาบาลี อักษรไทย ฉ. ฉัฏฐสังคายนา.<br>๏ ฉฏฺฐสงฺคายนาย ทยฺยภาสาวณฺโณ อภิธมฺมสงฺเขป - สงฺคหคนฺโถ.";
	global.langs["deOtherBook"]	="<div align=center><b>:: อญฺญคนฺโถ ::</b></div>๏ หนังสือหมวด อื่น.<br>๏ ฉฏฺฐสงฺคายนาย ทยฺยภาสาวณฺโณ อญฺญคนฺโถ.";
	global.langs["dePT"]	="<div align=center><b>:: พระไตรปิฎกแปล ::</b></div>๏ หนังสือหมวด พระไตรปิฎกแปล ภาษาไทย ฉ. มหาวิทยาลัย มหาจุฬาลงกรณ์ ราชวิทยาลัย.<br>๏ มหาวิทยาลยสฺส มหาจุฬาลงฺกรณสฺส ทยฺยภาสาปริวตฺติย เตปิฏกคนฺโถ.";
	global.langs["deAT"]	="<div align=center><b>:: อรรถกถาแปล ::</b></div>๏ หนังสือหมวด อรรถกถาแปล ภาษาไทย ฉ. มหาวิทยาลัย มหามกุฎ ราชวิทยาลัย และ ฉ. มหาวิทยาลัย มหาจุฬาลงกรณ์ ราชวิทยาลัย.<br>๏ มหาวิทยาลยสฺส มหามกุฏสฺส จ มหาวิทยาลยสฺส มหาจุฬาลงฺกรณสฺส จ ทยฺยภาสาปริวตฺติย อฏฺฐกถาคนฺโถ.";
	global.langs["deTT"]	="<div align=center><b>:: ฏีกาแปล ::</b></div>๏ หนังสือหมวด ฏีกาแปล ภาษาไทย.<br>๏ ทยฺยภาสาปริวตฺติย ฏีกาคนฺโถ.";
	global.langs["deVinayaPrecisT"]	="<div align=center><b>:: ::</b></div>๏ ";
	global.langs["deSuttantaPrecisT"]	="<div align=center><b>:: ::</b></div>๏ ";
	global.langs["deAbhidhammaPrecisT"]	="<div align=center><b>:: ::</b></div>๏ ";
	//สะเตมี : เรียนพระไตรปิฎก
	global.langs["LTVinayaT"]	="วินัยแปล";
	global.langs["LTSuttantaT"]	="สูตรแปล";
	global.langs["LTAbhidhammaT"]	="อภิธรรมแปล";
	global.langs["deLTVinayaT"]	="<div align=center><b>:: วินัยแปล ::</b></div>๏ หนังสือหมวด พระวินัยปิฎก และ อรรถกถาแปล ภาษาไทย ฉ. มหาวิทยาลัย มหามกุฎ ราชวิทยาลัย.<br>๏ มหาวิทยาลยสฺส มหามกุฏสฺส ทยฺยภาสาปริวตฺติย วินยปิฏกคนฺโถ อฏฺฐกถาคนฺโถ จ.";
	global.langs["deLTSuttantaT"]	="<div align=center><b>:: สูตรแปล ::</b></div>๏ หนังสือหมวด พระสูตร และ อรรถกถาแปล ภาษาไทย ฉ. มหาวิทยาลัย มหามกุฎ ราชวิทยาลัย.<br>๏ มหาวิทยาลยสฺส มหามกุฏสฺส ทยฺยภาสาปริวตฺติย สุตฺตนฺตปิฏกคนฺโถ อฏฺฐกถาคนฺโถ จ.";
	global.langs["deLTAbhidhammaT"]	="<div align=center><b>:: อภิธรรมแปล ::</b></div>๏ หนังสือหมวด พระอภิธรรมปิฎก และ อรรถกถาแปล ภาษาไทย ฉ. มหาวิทยาลัย มหามกุฎ ราชวิทยาลัย.<br>๏ มหาวิทยาลยสฺส มหามกุฏสฺส ทยฺยภาสาปริวตฺติย อภิธมฺมปิฏกคนฺโถ อฏฺฐกถาคนฺโถ จ.";
	//เล่ม - ข้อ - หน้า
	global.langs["BookNum"]	="เลขเล่ม";
	global.langs["deBookNumForm"]	="<div align=center><b>:: เลขเล่ม ::</b></div>๏ พิมพ์หมายเลขเล่ม ที่ท่านต้องการ ที่ช่องนี้. สามารถดูเลขเล่มด้วยปุ่ม [?] ด้านบน ";
	global.langs["SpanNum"]	="เลขข้อ";
	global.langs["deSpanNum"]	="<div align=center><b>:: เลขข้อ(ปพฺพ) ::</b></div>๏ เลขข้อของ ข้อความที่ท่าน กำลังเปิดอยู่. บางช่วงของคัมภีร์ โดยเฉพาะตอนขึ้นต้นคัมภีร์ อาจไม่มีเลขข้อ ซึ่งอาจทำให้ลิงค์ไปยัง คัมภีร์ที่เกี่ยวข้องไม่ได้ ซึ่งทางระบบได้เปิดการเข้า ที่หน้าแรกของคัมภีร์สำรองไว้ให้ เพื่อเข้าชมแบบเปิดอ่าน หรือ อาจใช้วิธีค้นคำที่คาดว่า จะได้พบก็เป็นการประยุกต์ที่ ได้ผลดีในระดับหนึ่งเช่นกัน. ";
	global.langs["deSpanNumForm"]	="<div align=center><b>:: เลขข้อ ::</b></div>๏ พิมพ์หมายเลขข้อ ที่ท่านต้องการ ที่ช่องนี้. ";
	global.langs["PageNum"]	="เลขหน้า";
	global.langs["dePageNumForm"]	="<div align=center><b>:: เลขหน้า ::</b></div>๏ พิมพ์หมายเลขหน้า ที่ท่านต้องการ ที่ช่องนี้";
	
//เมนูในหน้าแสดงผลการค้นและเปิดอ่าน
	//เมนูเสริม
	global.langs["All"]	="ทั้งหมด";
	global.langs["deAll"]	="<div align=center><b>:: ทั้งหมด ::</b></div>๏ ทั้งหมดทั้งปวง.<br>๏ สพฺพํ.";
	global.langs["deViewOptionMenuForm"]	="<div align=center><b>:: เปิดเมนูเสริม ::</b></div>๏ เปิดเมนูเสริม.<br><b><u>เมนูเสริม</u></b> เป็นกลุ่มของ อุปกรณ์ที่ช่วย ในการเพิ่มมุมมอง ของหน้าให้กว้างขึ้น โดยท่านสามารถ เปิดย่อหน้าด้านบน และล่าง ต่อจาก ย่อหน้า ที่กำลังเปิดอยู่ เพื่อเข้าใช้งาน ระบบข้อความ เหล่านั้น และไปยังย่อหน้า ที่มีหมายเลข ตามที่ท่าน ต้องการได้ อีกด้วย.";
	global.langs["deLinkViewOptionMenu"]	="<div align=center><b>:: เมนูเสริม ::</b></div>๏ แสดง เฉพาะย่อหน้านี้ พร้อม<u>ช่องเปิดเนื้อหาเพิ่มเติม</u> และ <u>ช่องไปยังช่วงหน้าที่ต้องการ</u>.<br>๏ อิโต อยํ วตฺถุกมาติกาเยว จ อภิทสฺสนุปกรณญฺจ วตฺถุคมนุปกรณญฺจ อุปคเมยฺยาถ.";
	global.langs["deLinkPreviousnessParagraph"]	="<div align=center><b>:: ย่อหน้าก่อน ::</b></div>๏ ไปยัง ย่อหน้า ก่อนนี้.<br>๏ อิโต อิโต วตฺถุกา มาติกาย วา เอกวตฺถุกเหฏฺฐาว อุปคเมยฺยาถ.";

	global.langs["deLinkNextParagraph"]	="<div align=center><b>:: ย่อหน้าถัดไป ::</b></div>๏ ไปยัง ย่อหน้า ถัดไป.<br>๏ อิโต อิโต วตฺถุกา มาติกาย วา เอกวตฺถุกปราเยว อุปคเมยฺยาถ.";
	global.langs["deLinkPreviousnessStory"]	="<div align=center><b>:: เรื่องก่อนหน้า ::</b></div>๏ ไปยัง หัวข้อเรื่อง ก่อนนี้.<br>๏ อิโต อิโต วตฺถุกา มาติกาย วา เอกมาติกาปราว อุปคเมยฺยาถ.";
	global.langs["deLinkViewOptionStory"]	="<div align=center><b>:: เรื่องปัจจุบัน ::</b></div>๏ แสดง หัวข้อเรื่อง ปัจจุบัน.<br>๏ อิโต อยํ มาติกาเยว อุปคเมยฺยาถ.";
	global.langs["deLinkNextStory"]	="<div align=center><b>:: เรื่องถัดไป ::</b></div>๏ ไปยังหัว ข้อเรื่อง ถัดไป.<br>๏ อิโต อิโต วตฺถุกา มาติกาย วา เอกมาติกาปราเยว อุปคเมยฺยาถ.";
	global.langs["deLinkPP"]	="<div align=center><b>:: เตปิฏกปาฬิ ::</b></div>๏ เปิด พระไตรปิฎกภาษาบาลี ของเล่ม+ข้อนี้ (ถ้ามี).<br>๏ อิโต อิมสฺส คนฺถสฺส ปิฏเก อิเมน คนฺเถน สเหกตฺตํ ปพฺพํ อุปคเมยฺยาถ.";
	global.langs["deLinkAP"]	="<div align=center><b>:: อฏฺฐกถาปาฬิ ::</b></div>๏ เปิด อรรถกถาภาษาบาลี ของเล่ม+ข้อนี้ (ถ้ามี).<br>๏ อิโต อิมสฺส คนฺถสฺส อฏฺฐกถายํ อิเมน คนฺเถน สเหกตฺตํ ปพฺพํ อุปคเมยฺยาถ.";
	global.langs["deLinkTP"]	="<div align=center><b>:: ฏีกาปาฬิ ::</b></div>๏ เปิด ฏีกาภาษาบาลี ของเล่ม+ข้อนี้ (ถ้ามี).<br>๏ อิโต อิมสฺส คนฺถสฺส ฏีกายํ อิเมน คนฺเถน สเหกตฺตํ ปพฺพํ อุปคมถ.";
	global.langs["deLinkPT"]	="<div align=center><b>:: พระไตรปิฎกแปล ::</b></div>๏ เปิด พระไตรปิฎกแปลภาษาไทย ของเล่ม+ข้อนี้ (ถ้ามี.<br>๏ อิโต อิมสฺส คนฺถสฺส ทยฺยรฏฺฐภาสาปริวตฺติยปิฏเก อิเมน คนฺเถน สเหกตฺตํ ปพฺพํ อุปคเมยฺยาถ.";
	global.langs["deLinkAT"]	="<div align=center><b>:: อรรถกถาแปล ::</b></div>๏ เปิด อรรถกถาแปลภาษาไทย ของเล่ม+ข้อนี้ (ถ้ามี).(เฉพาะมัชฌิม-อังคุตตร).<br>๏ อิโต อิมสฺส คนฺถสฺส ทยฺยรฏฺฐภาสาปริวตฺติยอฏฺฐกถายํ อิเมน คนฺเถน สเหกตฺตํ ปพฺพํ อุปคเมยฺยาถ.";
	global.langs["deLinkTT"]	="<div align=center><b>:: ฏีกาแปล ::</b></div>๏ เปิด ฏีกาแปลภาษาไทย ของเล่ม+ข้อนี้ (ถ้ามี).<br>๏ อิโต อิมสฺส คนฺถสฺส ทยฺยรฏฺฐภาสาปริวตฺติยฏีกายํ อิเมน คนฺเถน สเหกตฺตํ ปพฺพํ อุปคเมยฺยาถ.";
	global.langs["deLinkPreviousnessParagraph1"]	="<img src=./images/1b.png border=no width=16 height=16 /><span><div align=center><b>:: ก่อน 1 ย่อหน้า ::</b></div>๏ ไปยัง ย่อหน้าก่อนนี้.<br>๏ อิโต อิโต วตฺถุกา ปญฺจวตฺถุกเหฏฺฐา อุปคเมยฺยาถ.";
	global.langs["deLinkPreviousnessParagraph5"]	="<img src=./images/5b.png border=no width=16 height=16 /><span><div align=center><b>:: ก่อน 5 ย่อหน้า ::</b></div>๏ ไปยัง ย่อหน้าที่ 5 ก่อนนี้.<br>๏ อิโต อิโต วตฺถุกา ปญฺจวตฺถุกเหฏฺฐา อุปคเมยฺยาถ.";
	global.langs["deLinkPreviousnessParagraph20"]	="<img src=./images/20b.png border=no width=16 height=16 /><span><div align=center><b>:: ก่อน 20 ย่อหน้า ::</b></div>๏ ไปยัง ย่อหน้าที่ 20 ก่อนนี้<br>๏ อิโต อิโต วตฺถุกา วีสติวตฺถุกเหฏฺฐา อุปคเมยฺยาถ.";
	global.langs["deLinkNextParagraph1"]	="<img src=./images/1f.png border=no width=16 height=16 /><span><div align=center><b>:: ถัดไป 1 ย่อหน้า ::</b></div>๏ ไปยัง ย่อหน้าถัดไป.<br>๏ อิโต อิโต วตฺถุกา ปญฺจวตฺถุกาปรา อุปคเมยฺยาถ.";
	global.langs["deLinkNextParagraph5"]	="<img src=./images/5f.png border=no width=16 height=16 /><span><div align=center><b>:: ถัดไป 5 ย่อหน้า ::</b></div>๏ ไปยัง ย่อหน้าที่ 5 ถัดนี้.<br>๏ อิโต อิโต วตฺถุกา ปญฺจวตฺถุกาปรา อุปคเมยฺยาถ.";
	global.langs["deLinkNextParagraph20"]	="<img src=./images/20f.png border=no width=16 height=16 /><span><div align=center><b>:: ถัดไป 20 ย่อหน้า ::</b></div>๏ ไปยัง ย่อหน้าที่ 20 ถัดนี้.<br>๏ อิโต อิโต วตฺถุกา วีสติวตฺถุกาปรา อุปคเมยฺยาถ.";
	global.langs["deLinkBegin"]	="<img src=./images/first.png border=no width=16 height=16 /><span><div align=center><b>:: ย่อหน้าแรก ::</b></div>๏ ไปยัง ย่อหน้าแรก ของเล่มนี้.<br>๏ อิโต อิโต ปฐมวตฺถุกํ อุปคเมยฺยาถ.";
	global.langs["deLinkEnd"]	="<img src=./images/end.png border=no width=16 height=16 /><span><div align=center><b>:: ย่อหน้าสุดท้าย ::</b></div>๏ ไปยัง ย่อหน้าสุดท้าย ของเล่มนี้.<br>๏ อิโต อิโต ปริโยสานวตฺถุกํ อุปคเมยฺยาถ.";
	global.langs["deLinkRelateAll"]	="<div align=center><b>:: เชื่อมทั้งหมด ::</b></div>๏ เปิด พระไตรปิฎก - อรรถกถา - ฏีกา บาลี+แปล เล่ม+ข้อนี้ ทั้งหมด.<br>๏ อิโต สพฺพํ เอกตฺตํ วตฺถุกํ อุปคเมยฺยาถ.";
	global.langs["deLinkPrecisPP"]	="<div align=center><b>:: สงฺคหปาฬิ ::</b></div>๏ เปิด สังคหคันถภาษาบาลี (ที่สหภาพเมียนม่า จัดเข้าในกลุ่มพระไตรปิฎก) ของเล่ม+ข้อนี้ (ถ้ามี).<br>๏ อิโต อิมสฺส คนฺถสฺส สงฺคหปาฬิยํ อิเมน (ปิฏเก มรมฺมรฏฺเฐน สงฺขิเยน) คนฺเถน สเหกตฺตํ ปพฺพํ อุปคเมยฺยาถ.";
	global.langs["deLinkPrecisAP"]	="<div align=center><b>:: สงฺคหอฏฺฐกถาปาฬิ ::</b></div>๏ เปิด สังคหอรรถกถาภาษาบาลี ของเล่ม+ข้อนี้ (ถ้ามี).<br>๏ อิโต อิมสฺส คนฺถสฺส สงฺคหฏฺฐกถายํ อิเมน คนฺเถน สเหกตฺตํ ปพฺพํ อุปคเมยฺยาถ.";
	global.langs["deLinkPrecisTP"]	="<div align=center><b>:: สงฺคหฏีกาปาฬิ ::</b></div>๏ เปิด สังคหฏีกาภาษาบาลี ของเล่ม+ข้อนี้ (ถ้ามี).<br>๏ อิโต อิมสฺส คนฺถสฺส สงฺคหฏีกายํ อิเมน คนฺเถน สเหกตฺตํ ปพฺพํ อุปคมถ.";
	global.langs["deLinkPrecisPT"]	="<div align=center><b>:: สังคหปกรณ์หมวด พระไตรปิฎกแปล ::</b></div>๏ เปิด สังคหคันถะ (ที่สหภาพเมียนม่า จัดเข้าใน กลุ่มพระไตรปิฎก) แปลภาษาไทย ของเล่ม+ข้อนี้ (ถ้ามี).<br>๏ อิโต อิมสฺส คนฺถสฺส ทยฺยรฏฺฐภาสาปริวตฺติยคนฺเถ อิเมน (ปิฏเก มรมฺมรฏฺเฐน สงฺขิเยน) สงฺคหคนฺเถน สเหกตฺตํ ปพฺพํ อุปคเมยฺยาถ.";
	global.langs["deLinkPrecisAT"]	="<div align=center><b>:: สังคหอรรถกถาแปล ::</b></div>๏ เปิด สังคหอรรถกถา แปลภาษาไทย ของเล่ม+ข้อนี้ (ถ้ามี).<br>๏ อิโต อิมสฺส คนฺถสฺส ทยฺยรฏฺฐภาสาปริวตฺติยอฏฺฐกถายํ อิเมน คนฺเถน สเหกตฺตํ ปพฺพํ อุปคเมยฺยาถ.";
	global.langs["deLinkPrecisTT"]	="<div align=center><b>:: สังคหฏีกาแปล ::</b></div>๏ เปิด สังคหฏีกาแปลภาษาไทย ของเล่ม+ข้อนี้ (ถ้ามี).<br>๏ อิโต อิมสฺส คนฺถสฺส ทยฺยรฏฺฐภาสาปริวตฺติยฏีกายํ อิเมน คนฺเถน สเหกตฺตํ ปพฺพํ อุปคเมยฺยาถ.";

	global.langs["deStoryName"]	="<div align=center><b>:: เตือนเกี่ยวกับชื่อเรื่อง(วตฺถุ) ::</b></div>๏ มีข้อแนะนำว่า ท่านควรใช้เล่ม และข้อในการอ้างอิงปกรณ์ กลุ่มสังคหอัฏฐกถา-ฏีกา ไม่ควรใช้ชื่อหัวเรื่อง(วตฺถุ) เช่น จตุตฺถปริจฺเฉโท เป็นต้นที่แสดงอยู่นี้(หากไม่แน่ใจ), เพราะปกรณ์บาลี กลุ่มสังคหอรรถกถา - ฏีกาบางเล่ม แสดงชื่อเรื่องไว้ท้ายเรื่อง ทำให้ชื่อเรื่อง เคลื่อนจากหัวข้อของตนไป 1 เรื่อง. หากจะอ้างอิงด้วยชื่อเรื่อง ควรเปิดดูด้วย เมนูหัวข้อเรื่อง ทั้งก่อน และหลัง หัวข้อนั้น หรือ เพิ่มย่อหน้าทั้งบน และล่างเพื่อเชค ก่อนอ้างอิงด้วยว่า เป็นชื่อเรื่อง ของหัวข้อที่กำลังเปิดอยู่ (กรณีคัมภีร์แสดงชื่อเรื่องก่อนแสดงเรื่อง) หรือข้อ ก่อนนี้ (กรณีคัมภีร์นั้นแสดงชื่อเรื่องไว้ท้ายเรื่อง ซึ่งปกติพบในสังคหอรรถกถา-ฏีกา เช่น วินยวินิจฉยอฏฺฐกถา ของท่านพระพุทธทัตตาจารย์ เป็นต้น.) ส่วนคัมภีร์กลุ่มอื่นยังไม่พบปัญหานี้.";
	global.langs["Bug"]	="สะเตมี : ติชม";
	global.langs["deBug"]	="<div align=center><b>:: สะเตมี : ติชม ::</b></div>๏ บอกอะไร บางอย่างกับสะเตมี : เช่น ข้อผิดพลาด ข้อแนะนำ ข้อติ ข้อชม ข้อเสริม ฯลฯ.<br>๏ อิโต สเตมิยํ ตํ ตํ ทุสฺสภาวํ สเตมีโคปกสฺส วตฺเตตุ<b>ํ</b> สเตมีเวปฺไซตํ อุปคมถ.";
function langs(id) {
	if (arguments.length>1){document.getElementById(arguments[1]).innerHTML=global.langs[id];}
	else {document.getElementById(id).innerHTML=global.langs[id];}
	}