/*ท่านสามารถนำสคริปเหล่านี้ไปใช้ได้ โดยไม่ต้องแก้ไขแต่อย่างใด แต่แนะนำว่า หากเคารพพระพุทธเจ้า พระธรรม 
และพระสงฆ์ ไม่ว่าท่านจะใช้โดยตรง หรือแก้ไขเท่าใดก็ตาม ขอให้ใช้ชื่อสคริปว่า Tipitaka เพื่ออุปนิสัยในการศึกษาพระไตรปิฏแในอนาคต
และคงข้อความคอมเม้นนี้ไว้, หรือแม้จะไม่ได้ใช้เลย ก็ควรนำลิงค์ http://www.satemy.com, http://www.84000.org/tipitaka เป็นต้น (ที่เหลือดูที่หน้าเว็บ)
อย่างน้อยลิงค์ใดลิงค์หนึ่งไปติดที่เว็บของท่าน เพื่อช่วยพระศาสนาที่กำลังเข้าขั้นวิกฤติด้วยครับเพราะบุรพาจารย์ระบุไว้ว่า 
ปริยัติเป็นเครื่องวัดอายุของพระศาสนา ครับ(ปริยัติพระพุทธพจน์ ไม่ใช่ปริยัติสามัญที่พระทำกันทุกวันนี้)*/
/*Satemy Pali Keyboard*/
function KeyBoard(Switch) {
	var key,keyShow,kf,kl,vak,mode,puts;
	key = "ก,ข,ค,ฆ,ง,จ,ฉ,ช,ฌ,ญ,ฏ,ฐ,ฑ,ฒ,ณ,ต,ถ,ท,ธ,น,ป,ผ,พ,ภ,ม,ย,ร,ล,ว,ส,ห,ฬ,อ,า,ิ,ี, ุ, ู,เ,โ,ฺ,ํ,ึ,,,,,+,ลบ,ล้าง";
	keyShow = "ก,ข,ค,ฆ,ง,จ,ฉ,ช,ฌ,ญ,ฏ,ฐ,ฑ,ฒ,ณ,ต,ถ,ท,ธ,น,ป,ผ,พ,ภ,ม,ย,ร,ล,ว,ส,ห,ฬ,อ,า,อิ,อี,อุ,อู,เอ,โอ,อฺ,อํ,อึ,,,,,เว้น,ลบ,ล้าง";
	key = key.split(","); keyShow = keyShow.split(",");
	kf = Array("ก","จ","ฏ","ต","ป","ย","อ","อฺ"); kl = Array("ง","ญ","ณ","น","ม","ฬ","โอ","ล้าง");
	msg="<table >";
	for (var i=0; i < keyShow.length; i++) {
		for (var i1=0; i1 < kf.length; i1++) { if (keyShow[i]==kf[i1]) {msg=msg+"<tr>"; vak=""+kf[i1]+":";} }
		msg=msg+"<td bgcolor=#F6f6f6 align=center>"+vak+" <a href=# onclick=cha('"+key[i]+"') > <font size=5 >"+keyShow[i]+"</font> </a></td>";
		for (var i1=0; i1 < kl.length; i1++) { if (key[i]==kl[i1]) {msg=msg+"</tr>";} }
		vak="";
	}
	msg=msg+"</table>";
	switch (Switch) {
		case 1 : puts = msg; mode = 0;break;
		case 0 : puts = ""; mode = 1;break;
	}
		document.getElementById("KeyBoard").innerHTML = puts;
		document.getElementById("switchKeyBoard").innerHTML ="<a href=# onclick='KeyBoard("+mode+")' ><img src=images/keyboard.png border=no></a>";
}
/*ใส่คีย์บอร์ด*/
function cha(cha){
	var str=document.form1.elements.search.value;
		switch (cha) {
			case "ลบ"	: str = str.substring(0,(str.length-1));break;
			case "ล้าง"	: str = "" ;break;
			default			: str = str+cha;
		}
			document.form1.search.value=str; 
			document.form1.search.focus();
}
function Popup() {
	var owin= window.open("script/keyboard/keyBoard.html",arguments[1],"left=400, top=200, height=200, width=200, resizable=yes, scrollable=yes, toolbar=no, status=no, location=no");
	owin.document.close();
}

function Encode() {
	var id;
	switch (arguments[0]){
	case 'search1': id='search1';break;
	case undefined: id='search';break;
	case 'standin': id="standin";break;
	default :id=arguments[0];break;
	}
	var s=document.getElementById(id).value;
	var key = new Array('ก','ข','ฃ','ค','ฅ','ฆ','ง','จ', 'ฉ','ช','ซ','ฌ','ญ','ฎ','ฏ','ฐ','ฑ','ฒ','ณ','ด','ต','ถ','ท','ธ','น','บ','ป','ผ','ฝ','พ','ฟ','ภ','ม','ย','ร','ฤ','ล','ฦ','ว','ศ','ษ','ส','ห','ฬ','อ','ฮ', 'ฯ','ะ','ั','า','ำ','ิ','ี','ึ','ื','ุ','ู','ฺ','?','?','?','?','฿','เ','แ','โ','ใ','ไ','ๅ','ๆ','็','่','้','๊','๋','์','ํ','๎','๏','๐','๑','๒','๓','๔','๕','๖','๗','๘','๙','๚','๛','?' ,'?','?','?');
		for (var i=0;i<key.length;i++ ){
				for (var i1=0;i1<=s.length;i1++ ){
					s=s.replace(key[i],"b"+i+"e");
				}
			}
	document.getElementById(id).value=s;
}

function Decode() {
	var id;
	switch (arguments[0]){
	case 'search1': id='search1';break;
	case undefined: id='search';break;
	case 'standin': id="standin";break;
	default :id=arguments[0];break;
	}
	var s=document.getElementById(id).value;
	var key = new Array('ก','ข','ฃ','ค','ฅ','ฆ','ง','จ', 'ฉ','ช','ซ','ฌ','ญ','ฎ','ฏ','ฐ','ฑ','ฒ','ณ','ด','ต','ถ','ท','ธ','น','บ','ป','ผ','ฝ','พ','ฟ','ภ','ม','ย','ร','ฤ','ล','ฦ','ว','ศ','ษ','ส','ห','ฬ','อ','ฮ', 'ฯ','ะ','ั','า','ำ','ิ','ี','ึ','ื','ุ','ู','ฺ','?','?','?','?','฿','เ','แ','โ','ใ','ไ','ๅ','ๆ','็','่','้','๊','๋','์','ํ','๎','๏','๐','๑','๒','๓','๔','๕','๖','๗','๘','๙','๚','๛','?' ,'?','?','?');
	//var key = "ก,ข,ค,ฆ,ง,จ,ฉ,ช,ฌ,ญ,ฏ,ฐ,ฑ,ฒ,ณ,ต,ถ,ท,ธ,น,ป,ผ,พ,ภ,ม,ย,ร,ล,ว,ส,ห,ฬ,อ,า,ิ,ี, ุ, ู,เ,โ,ฺ,ํ,ึ"; key = key.split(",");
		for (var i=-1;i<key.length;i++ ){
			for (var i1=0;i1<=s.length;i1++ ){
				s=s.replace("b"+i+"e",key[i]);
			}
		}
	document.getElementById(id).value=s;
}

function EncodeText(s) {
	var key = new Array('ก','ข','ฃ','ค','ฅ','ฆ','ง','จ', 'ฉ','ช','ซ','ฌ','ญ','ฎ','ฏ','ฐ','ฑ','ฒ','ณ','ด','ต','ถ','ท','ธ','น','บ','ป','ผ','ฝ','พ','ฟ','ภ','ม','ย','ร','ฤ','ล','ฦ','ว','ศ','ษ','ส','ห','ฬ','อ','ฮ', 'ฯ','ะ','ั','า','ำ','ิ','ี','ึ','ื','ุ','ู','ฺ','?','?','?','?','฿','เ','แ','โ','ใ','ไ','ๅ','ๆ','็','่','้','๊','๋','์','ํ','๎','๏','๐','๑','๒','๓','๔','๕','๖','๗','๘','๙','๚','๛','?' ,'?','?','?');
		for (var i=0;i<key.length;i++ ){
				for (var i1=0;i1<=s.length;i1++ ){
					s=s.replace(key[i],"b"+i+"e");
				}
			}
return s;
}

var PDBp =new Array("",
	"null ,วินยปิฏก มหาวิภงฺคปาฬิ 1 - วิ.มหา. ,วินยปิฏก มหาวิภงฺคปาฬิ 2 - วิ.มหา. ,วินยปิฏก ภิกฺขุนีวิภงฺคปาฬิ - วิ.ภิกฺขุนี. ,วินยปิฏก มหาวคฺคปาฬิ 1 - วิ.ม. ,วินยปิฏก มหาวคฺคปาฬิ 2 - วิ.ม. ,วินยปิฏก จูฬวคฺคปาฬิ 1 - วิ.จู. ,วินยปิฏก จูฬวคฺคปาฬิ 2 - วิ.จู. ,วินยปิฏก ปริวารปาฬิ (อุปาลิมหาเถร) - วิ.ป. ,ทีฆนิกาย สีลกฺขนฺธวคฺคปาฬิ - ที.สี. ,ทีฆนิกาย มหาวคฺคปาฬิ - ที.ม. ,ทีฆนิกาย ปาฏิกวคฺคปาฬิ - ที.ปา. ,มชฺฌิมนิกาย มูลปณฺณาสกปาฬิ - ม.มู. ,มชฺฌิมนิกาย มชฺฌิมปณฺณาสกปาฬิ - ม.ม. ,มชฺฌิมนิกาย อุปริปณฺณาสกปาฬิ - ม.อุ. ,สํยุตฺตนิกาย สคาถวคฺคปาฬิ - สํ.ส. ,สํยุตฺตนิกาย นิทานวคฺคปาฬิ - สํ.นิ. ,สํยุตฺตนิกาย ขนฺธวารวคฺคปาฬิ - สํ.ข. ,สํยุตฺตนิกาย สฬายตนวคฺคปาฬิ - สํ.สฬา. ,สํยุตฺตนิกาย มหาวารวคฺคปาฬิ - สํ.ม. ,องฺคุตฺตรนิกาย เอกกนิปาตปาฬิ - องฺ.เอกก. + องฺคุตฺตรนิกาย ทุกนิปาตปาฬิ - องฺ.ทุก. + องฺคุตฺตรนิกาย ติกนิปาตปาฬิ - องฺ.ติก. ,องฺคุตฺตรนิกาย จตุกฺกนิปาตปาฬิ - องฺ.จตุกฺก. ,องฺคุตฺตรนิกาย ปญฺจกนิปาตปาฬิ - องฺ.ปญฺจก. + องฺคุตฺตรนิกาย ฉกฺกนิปาตปาฬิ - องฺ.ฉกฺก. ,องฺคุตฺตรนิกาย สตฺตกนิปาตปาฬิ - องฺ.สตฺตก. + องฺคุตฺตรนิกาย อฏฺฐกนิปาตปาฬิ - องฺ.อฏฺฐก. + องฺคุตฺตรนิกาย นวกนิปาตปาฬิ - องฺ.นวก. ,องฺคุตฺตรนิกาย ทสกนิปาตปาฬิ - องฺ.ทสก. + องฺคุตฺตรนิกาย เอกาทสกนิปาตปาฬิ - องฺ.เอกาทสก. ,ขุทฺทกนิกาย ขุทฺทกปาฐปาฬิ - ขุ.ขุ. + ขุทฺทกนิกาย ธมฺมปทปาฬิ - ขุ.ธ. + ขุทฺทกนิกาย อุทานปาฬิ - ขุ.อุ. + ขุทฺทกนิกาย อิติวุตฺตกปาฬิ - ขุ.อิติ. + ขุทฺทกนิกาย สุตฺตนิปาตปาฬิ - ขุ.สุ. ,ขุทฺทกนิกาย วิมานวตฺถุปาฬิ - ขุ.วิ. + ขุทฺทกนิกาย เปตวตฺถุปาฬิ - ขุ.เปต. + ขุทฺทกนิกาย เถรคาถาปาฬิ - ขุ.เถร. + ขุทฺทกนิกาย เถรีคาถาปาฬิ - ขุ.เถรี. ,ขุทฺทกนิกาย ชาตกปาฬิ 1 - ขุ.ชา. ,ขุทฺทกนิกาย ชาตกปาฬิ 2 - ขุ.ชา. ,ขุทฺทกนิกาย มหานิทฺเทสปาฬิ (สาริปุตฺตมหาเถร) - ขุ.ม. ,ขุทฺทกนิกาย จูฬนิทฺเทสปาฬิ (สาริปุตฺตมหาเถร) - ขุ.จู. ,ขุทฺทกนิกาย ปฏิสมฺภิทามคฺคปาฬิ (สาริปุตฺตมหาเถร) - ขุ.ป. ,ขุทฺทกนิกาย อปทานปาฬิ 1 - ขุ.อป. ,ขุทฺทกนิกาย อปทานปาฬิ 2 - ขุ.อป. + ขุทฺทกนิกาย พุทฺธวํสปาฬิ - ขุ.พุทฺธ. + ขุทฺทกนิกาย จริยาปิฏกปาฬิ - ขุ.จริยา. ,อภิธมฺมปิฏก ธมฺมสงฺคณิปาฬิ - อภิ.สงฺ. ,อภิธมฺมปิฏก วิภงฺคปาฬิ - อภิ.วิ. ,อภิธมฺมปิฏก ธาตุกถาปาฬิ - อภิ.ธา. + อภิธมฺมปิฏก ปุคฺคลปญฺญตฺติปาฬิ - อภิ.ปุ. ,อภิธมฺมปิฏก กถาวตฺถุปาฬิ - อภิ.ก. ,อภิธมฺมปิฏก ยมกปาฬิ 1 - อภิ.ย. ,อภิธมฺมปิฏก ยมกปาฬิ 2 - อภิ.ย. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 1 - อภิ.ป. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 2 - อภิ.ป. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 3 - อภิ.ป. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 4 - อภิ.ป. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 5 - อภิ.ป. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 6 - อภิ.ป. ".split(","),
	"null ,สมนฺตปาสาทิกา-อฏฐถกถา 1 มหาวิภงฺค-อฏฐถกถา ปาราชิกกณฺฑ-อฏฺฐกถา ปาราชิกกณฺฑนฺตา (พุทฺธโฆส) - วิ.อฏฺ. 1. ,สมนฺตปาสาทิกา-อฏฐถกถา 2 มหาวิภงฺค-อฏฐถกถา 2 สงฺฆาทิเสสกณฺฑาทโย (พุทฺธโฆส) - วิ.อฏฺ. 2. + สมนฺตปาสาทิกา-อฏฐถกถา 2 ภิกฺขุนีวิภงค-อฏฺฐกถา (พุทฺธโฆส) - วิ.อฏฺ. 2. ,สมนฺตปาสาทิกา-อฏฐถกถา 3 มหาวคฺค(วิ)-อฏฺฐกถา (พุทฺธโฆส) - วิ.อฏฺ. 3. + สมนฺตปาสาทิกา-อฏฐถกถา 3 จูฬวคฺค-อฏฺฐกถา (พุทฺธโฆส) - วิ.อฏฺ. 3. + สมนฺตปาสาทิกา-อฏฐถกถา 3 ปริวารวคฺค-อฏฺฐกถา (พุทฺธโฆส) - วิ.อฏฺ. 3. ,สุมงฺคลวิลาสินี-อฏฐถกถา 1 สีลกฺขนฺธวคฺค-อฏฺฐกถา (พุทฺธโฆส) - ที.อฏฺ. 1. ,สุมงฺคลวิลาสินี-อฏฐถกถา 2 มหาวคฺค-อฏฺฐกถา(ที.) (พุทฺธโฆส) - ที.อฏฺ. 2. ,สุมงฺคลวิลาสินี-อฏฐถกถา 3 ปาถิกวคฺค-อฏฺฐกถา (พุทฺธโฆส) - ที.อฏฺ. 3. ,ปปญฺจสูทนี-อฏฐถกถา 1 มูลปณฺณาสก-อฏฺฐกถา 1 (พุทฺธโฆส) - ม.อฏฺ. 1(1). ,ปปญฺจสูทนี-อฏฐถกถา 1 มูลปณฺณาสก-อฏฺฐกถา 2 (พุทฺธโฆส) - ม.อฏฺ. 1(2). ,ปปญฺจสูทนี-อฏฐถกถา 2 มชฺฌิมปณฺณาสก-อฏฺฐกถา (พุทฺธโฆส) - ม.อฏฺ. 2. ,ปปญฺจสูทนี-อฏฐถกถา 3 อุปริปณฺณาสก-อฏฺฐกถา (พุทฺธโฆส) - ม.อฏฺ. 3. ,สารตฺถปฺปกาสินี-อฏฐถกถา 1 สคาถวคฺค-อฏฺฐกถา (พุทฺธโฆส) - สํ.อฏฺ. 1. ,สารตฺถปฺปกาสินี-อฏฐถกถา 2 นิทานวคฺค-อฏฺฐกถา (พุทฺธโฆส) - สํ.อฏฺ. 2(1). ,สารตฺถปฺปกาสินี-อฏฐถกถา 2 ขนฺธวคฺค-อฏฺฐกถา (พุทฺธโฆส) - สํ.อฏฺ. 2(2). ,สารตฺถปฺปกาสินี-อฏฐถกถา 3 สฬายตนวคฺค-อฏฺฐกถา (พุทฺธโฆส) - สํ.อฏฺ. 3(1). ,สารตฺถปฺปกาสินี-อฏฐกถา 3 มหาวารวคฺค-อฏฺฐกถา(สํ) (พุทฺธโฆส) - สํ.อฏฺ. 3(2). ,มโนรถปูรณี-อฏฐกถา 1 เอกกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 1. ,มโนรถปูรณี-อฏฐกถา 2 ทุกนิปาต--อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 2. + มโนรถปูรณี-อฏฐกถา 2 ติกนิปาต--อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 2. + มโนรถปูรณี-อฏฐกถา 2 จตุกฺกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 2. ,มโนรถปูรณี-อฏฐกถา 3 ปญฺจกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 ฉกฺกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 สตฺตกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 อฏฺฐกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 นวกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 ทสกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 เอกาทสกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. ,ปรมตฺถโชติกา ขุทฺทกปาฐ-อฏฺฐกถา (พุทฺธโฆส) - ขุ.ขุทฺทก.อฏฺ. ,ธมฺมปท-อฏฺฐกถา 1-4 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ธมฺม.อฏฺ. 1-4. ,ธมฺมปท-อฏฺฐกถา 5-8 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ธมฺม.อฏฺ. 5-8. ,ปรมตฺถทีปนี อุทาน-อฏฺฐกถา (ธมฺมปาล) - ขุ.อุ.อฏฺ. ,ปรมตฺถทีปนี อิติวุตฺตก-อฏฺฐกถา (ธมฺมปาล) - ขุ.อิ.อฏฺ. ,ปรมตฺถโชติกา สุตฺตนิปาต-อฏฺฐกถา 1 (พุทฺธโฆส) - ขุ.สุ.อฏฺ. 1. ,ปรมตฺถโชติกา สุตฺตนิปาต-อฏฺฐกถา 2 (พุทฺธโฆส) - ขุ.สุ.อฏฺ. 2. ,วิมานวตฺถุ-อฏฺฐกถา (ธมฺมปาล) - ขุ.วิ.อฏฺ. ,เปตวตฺถุ-อฏฺฐกถา (ธมฺมปาล) - ขุ.เปต.อฏฺ. ,ปรมตฺถทีปนี เถรคาถา-อฏฺฐกถา 1 (ธมฺมปาล) - ขุ.เถร.อฏฺ. 1. ,ปรมตฺถทีปนี เถรคาถา-อฏฺฐกถา 2 (ธมฺมปาล) - ขุ.เถร.อฏฺ. 2. ,ปรมตฺถทีปนี เถรีคาถา-อฏฺฐกถา (ธมฺมปาล) - ขุ.เถรี.อฏฺ. ,ชาตก-อฏฺฐกถา 1 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 1. ,ชาตก-อฏฺฐกถา 2 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 2. ,ชาตก-อฏฺฐกถา 3 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 3. ,ชาตก-อฏฺฐกถา 4 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 4. ,ชาตก-อฏฺฐกถา 5 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 5. ,ชาตก-อฏฺฐกถา 6 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 6. ,ชาตก-อฏฺฐกถา 7 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 7. ,สทฺธมฺมปฺปชฺโชติกา มหานิทฺเทส-อฏฺฐกถา (อุปเสน) - ขุ.มหา.อฏฺ. ,สทฺธมฺมปฺปชฺโชติกา จูฬนิทฺเทส-อฏฺฐกถา (อุปเสน) - ขุ.จูฬ.อฏฺ. ,สทฺธมฺมปฺปกาสินี 1 ปฏิสมฺภิทามคฺค-อฏฺฐกถา (มหานาม) - ขุ.ปฏิ.อฏฺ. 1. ,สทฺธมฺมปฺปกาสินี 2 ปฏิสมฺภิทามคฺค-อฏฺฐกถา (มหานาม) - ขุ.ปฏิ.อฏฺ. 2. ,วิสุทฺธชนวิลาสินี 1 อปทาน-อฏฺฐกถา - ขุ.อป.อฏฺ. 1. ,วิสุทฺธชนวิลาสินี 2 อปทาน-อฏฺฐกถา - ขุ.อป.อฏฺ. 2. ,ปรมตฺถทีปนี จริยาปิฏก-อฏฺฐกถา (ธมฺมปาล) - ขุ.จริยา.อฏฺ. ,มธุรตฺถวิลาสินี พุทฺธวํส-อฏฺฐกถา (พุทฺธทตฺต) - ขุ.พุทฺธ.อฏฺ. ,อฏฺฐสาลินี ธมฺมสงฺคณิ-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 1. ,สมฺโมหวิโนทนี วิภงฺค-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 2. ,ปรมตฺถทีปนี ปญฺจปฺปกรณ-อฏฺฐกถา ธาตุกถา-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 3. +ปรมตฺถทีปนี ปญฺจปฺปกรณ-อฏฺฐกถา ปุคฺคลปญฺญตฺติ-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 3. + ปรมตฺถทีปนี ปญฺจปฺปกรณ-อฏฺฐกถา กถาวตฺถุ-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 3. + ปรมตฺถทีปนี ปญฺจปฺปกรณ-อฏฺฐกถา ยมกปฺปกรณ-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 3. + ปรมตฺถทีปนี ปญฺจปฺปกรณ-อฏฺฐกถา ปฏฺฐานปฺปกรณ-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 3. ".split(","),
	"null ,สารตฺถทีปนี 1 มหาวิภงฺคฏีกา 1 ปาราชิกกณฺฑนฺตา (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 1. ,สารตฺถทีปนี 2 มหาวิภงฺคฏีกา 2 นิสฺสคฺคิยกณฺฑนฺตาโย (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 2. ,สารตฺถทีปนี 3 มหาวิภงฺคฏีกา 3 ปาจิตฺติยกณฺฑาทโย (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 3. + สารตฺถทีปนี 3 ภิกฺขุนีวิภงฺคฏีกา (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 3. + สารตฺถทีปนี 3 มหาวคฺคฏีกา (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 3. + สารตฺถทีปนี 3 จูฬวคฺคฏีกา (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 3. + สารตฺถทีปนี 3 ปริวารวคฺคฏีกา (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 3. ,วชิรพุทฺธิฏีกา มหาวิภงฺคฏีกา (วชิรพุทฺธิ) - วิ.วชิรพุทฺธิฏี. + วชิรพุทฺธิฏีกา ภิกฺขุนีวิภงฺคฏีกา (วชิรพุทฺธิ) - วิ.วชิรพุทฺธิฏี. + วชิรพุทฺธิฏีกา มหาวคฺคฏีกา (วชิรพุทฺธิ) - วิ.วชิรพุทฺธิฏี. + วชิรพุทฺธิฏีกา จูฬวคฺคฏีกา (วชิรพุทฺธิ) - วิ.วชิรพุทฺธิฏี. + วชิรพุทฺธิฏีกา ปริวารวคฺคฏีกา (วชิรพุทฺธิ) - วิ.วชิรพุทฺธิฏี. ,วิมติวิโนทนีฏีกา 1 มหาวิภงฺคฏีกา นิสฺสคฺคิยกณฺฑนฺตาโย (โจฬรฏฺฐกสฺสป) - .วิมติวิโนทนีฏี. 1. ,วิมติวิโนทนีฏีกา 2 มหาวิภงฺคฏีกา ปาจิตฺติยกณฺฑาทโย (โจฬรฏฺฐกสฺสป) - วิ.วิมติวิโนทนีฏี. 2. + วิมติวิโนทนีฏีกา 2 ภิกฺขุนีวิภงฺคฏีกา (โจฬรฏฺฐกสฺสป) - วิ.วิมติวิโนทนีฏี. 2. + วิมติวิโนทนีฏีกา 2 มหาวคฺคฏีกา (โจฬรฏฺฐกสฺสป) - วิ.วิมติวิโนทนีฏี. 2. + วิมติวิโนทนีฏีกา 2 จูฬวคฺคฏีกา (โจฬรฏฺฐกสฺสป) - วิ.วิมติวิโนทนีฏี. 2. + วิมติวิโนทนีฏีกา 2 ปริวารฏีกา (โจฬรฏฺฐกสฺสป) - วิ.วิมติวิโนทนีฏี. 2. ,ปาจิตฺยาทิโยชนา มหาวิภงฺคโยชนา (มรมฺมรฏฺฐชาคร) - วิ.ปาจิตฺยาทิโยชนา. + ปาจิตฺยาทิโยชนา ภิกฺขุนีวิภงฺคโยชนา (มรมฺมรฏฺฐชาคร) - วิ.ปาจิตฺยาทิโยชนา. + ปาจิตฺยาทิโยชนา มหาวคฺคโยชนา (มรมฺมรฏฺฐชาคร) - วิ.ปาจิตฺยาทิโยชนา. + ปาจิตฺยาทิโยชนา จูฬวคฺคโยชนา (มรมฺมรฏฺฐชาคร) - วิ.ปาจิตฺยาทิโยชนา. + ปาจิตฺยาทิโยชนา ปริวารโยชนา (มรมฺมรฏฺฐชาคร) - วิ.ปาจิตฺยาทิโยชนา. ,ลีนตฺถปฺปกาสนา 1 สีลกฺขนฺธวคฺคฏีกา (ธมฺมปาล) - ที.ฏี. 1. ,ลีนตฺถปฺปกาสนา 2 มหาวคฺคฏีกา (ธมฺมปาล) - ที.ฏี. 2. ,ลีนตฺถปฺปกาสนา 3 ปาถิกวคฺคฏีกา (ธมฺมปาล) - ที.ฏี. 3. ,สาธุวิลาสินี 1 สีลกฺขนฺธวคฺคอภินวฏีกา 1 (มรมฺมรฏฺฐญาณาภิวํสธมฺมเสนาปติ) - ที.สี.อภินวฏี. 1. ,สาธุวิลาสินี 2 สีลกฺขนฺธวคฺคอภินวฏีกา 2 (มรมฺมรฏฺฐญาณาภิวํสธมฺมเสนาปติ) - ที.สี.อภินวฏี. 2. ,ลีนตฺถปฺปกาสนา 1 มูลปณฺณาสกฏีกา 1 (ธมฺมปาล) - ม.ฏี. 1(1). ,ลีนตฺถปฺปกาสนา 1 มูลปณฺณาสกฏีกา 2 (ธมฺมปาล) - ม.ฏี. 1(2). ,ลีนตฺถปฺปกาสนา 2 มชฺฌิมปณฺณาสกฏีกา (ธมฺมปาล) - ม.ฏี. 2. ,ลีนตฺถปฺปกาสนา 3 อุปริปณฺณาสกฏีกา (ธมฺมปาล) - ม.ฏี. 3. ,ลีนตฺถปฺปกาสนา 1 สคาถวคฺคฏีกา (ธมฺมปาล) - สํ.ฏี. 1. ,ลีนตฺถปฺปกาสนา 2 นิทานวคฺคฏีกา (ธมฺมปาล) - สํ.ฏี. 2(1). ,ลีนตฺถปฺปกาสนา 2 ขนฺธวคฺคฏีกา (ธมฺมปาล) - สํ.ฏี. 2(2). ,ลีนตฺถปฺปกาสนา 3 สฬายตนวคฺคฏีกา (ธมฺมปาล) - สํ.ฏี. 3(1). ,ลีนตฺถปฺปกาสนา 3 มหาวคฺคฏีกา(สํ) (ธมฺมปาล) - สํ.ฏี. 3(2). ,สารตฺถมญฺชูสา 1 องฺคุตฺตรนิกายฏีกา เอกกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. ,สารตฺถมญฺชูสา 2 องฺคุตฺตรนิกายฏีกา ทุกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 2 ติกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 2 จตุกฺกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. ,สารตฺถมญฺชูสา 3 องฺคุตฺตรนิกายฏีกา ปญฺจกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 ฉกฺกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 สตฺตกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 อฏฺฐกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 นวกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 ทสกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 เอกาทสกฏีกา (สารีปุตฺต) - องฺ.ฏี. 3. ,อสมฺโมหวิลาสินี 1 ชาตก-อภินวฏีกา เอกกนิปาตฏีกา 1 -ขุ.ชา.เอกก.ฏี. 1. ,อสมฺโมหวิลาสินี 2 ชาตก-อภินวฏีกา เอกกนิปาตฏีกา 2 - ขุ.ชา.เอกก.ฏี. 2. ,อสมฺโมหวิลาสินี 3 ชาตก-อภินวฏีกา ทุกนิปาตฏีกา - ขุ.ชา.ทุก.ฏี. 3. ,อสมฺโมหวิลาสินี 4 ชาตก-อภินวฏีกา ติกนิปาตฏีกา - ขุ.ชา.ฏี. 4. + อสมฺโมหวิลาสินี 4 จตุกฺกนิปาตฏีกา - ขุ.ชา.ฏี. 4. + อสมฺโมหวิลาสินี 4 ชาตก-อภินวฏีกา ปญฺจกนิปาตฏีกา - ขุ.ชา.ฏี. 4. + อสมฺโมหวิลาสินี 4 ชาตก-อภินวฏีกา ฉกฺกนิปาตฏีกา - ขุ.ชา.ฏี. 4. ,มูลฏีกา 1 ธมฺมสงฺคณิ-มูลฏีกา (อานนฺท) - อภิ.มูลฏี. 1. ,ลีนตฺถวณฺณนา 1 ธมฺมสงฺคณิ-อนุฏีกา (ธมฺมปาล) - อภิ.อนุฏี. 1. ,มูลฏีกา 2 วิภงฺคมูลฏีกา (อานนฺท) - อภิ.มูลฏี. 2. ,ลีนตฺถวณฺณนา 2 วิภงฺค-อนุฏีกา (ธมฺมปาล) - อภิ.อนุฏี. 2. ,มูลฏีกา 3 ปญฺจปฺปกรณ-มูลฏีกา (อานนฺท) - อภิ.มูลฏี. 3. ,ลีนตฺถวณฺณนา 3 ปญฺจปฺปกรณ-อนุฏีกา (ธมฺมปาล) - อภิ.อนุฏี. 3. ".split(","),
	"null ,ขุทฺทสิกฺขา-สงฺเขปอฏฺฐกถา (ธมฺมสิริ) - ขุทฺทสิกขา. ,ขุทฺทสิกฺขาปุราณฏีกา (อญฺญตร ตฺยาจริยา - วาจิสฺสมหาสามิเถโร วา มหายสตฺเถโร วา เรวตฺตตฺเถโร วา)) - ขุทฺทสิกฺขา.ปุราณฏี. ,ขุทฺทสิกฺขาอภินวฏีกา สุมงฺคลปฺปสาทนี นาม (สงฺฆรกฺขิตมหาสามิ) - ขุทฺทสิกฺขา.อภินวฏี. ,มูลสิกฺขา-สงฺเขปอฏฺฐกถา (ธมฺมสิริ) - มูลสิกฺขา. ,มูลสิกฺขาฏีกา (อญฺญตร ทฺวฺยาจริยา - วาจิสฺสมหาสามิเถโร วา วิมลสารตฺเถโร วา) - มูลสิกฺขา.ฏี. ,วินยวินิจฺฉย-สงฺเขปอฏฺฐกถา (พุทฺธทตฺต) - วินยวินิจฺฉย. ,วินยวินิจฺฉยฏีกา 1 วินยตฺถสารสนฺทีปนี 1 นาม (อญฺญตร สาริปุตตาจริยสฺส สิสฺโส (วาจิสฺสตฺเถโร วา อุปติสฺสตฺเถโร วา)) - วินยวินิจฺฉย.ฏี. 1. ,วินยวินิจฺฉยฏีกา 2 วินยตฺถสารสนฺทีปนี 2 นาม (อญฺญตร สาริปุตตาจริยสฺส สิสฺโส (วาจิสฺสตฺเถโร วา อุปติสฺสตฺเถโร วา)) - วินยวินิจฺฉย.ฏี. 2. ,อุตฺตรวินิจฺฉย-สงฺเขปอฏฺฐกถา (พุทฺธทตฺต) - อุตฺตรวินิจฺฉย,อุตฺตรวินิจฺฉยฏีกา ลีนตฺถปฺปกาสินี นาม (อญฺญตร สาริปุตตาจริยสฺส สิสฺโส (วาจิสฺสตฺเถโร วา อุปติสฺสตฺเถโร วา)) - อุตฺตรวินิจฺฉย.ฏี. ,กงฺขาวิตรณี-วินยมาติกาอฏฺฐกถา (พุทฺธโฆส) - กงฺขา. ,กงฺขาวิตรณีปุราณฏีกา (น ปากฏํ) -กงฺขา.ปุราณฏี. ,กงฺขาวิตรณีอภินวฏีกา (พุทฺธนาค) - กงฺขา.อภินวฏี. ,วินยสงฺคห-สงฺเขปอฏฺฐกถา (สาริปุตฺต) - วินยสงฺคห. ,วินยสงฺคหอภินวฏีกา 1 วินยาลงฺการฎีกา 1 นาม (มรมฺมรฏฺฐเตปิฏกาลงฺการ(ตองลาภี)) - วินยสงฺคห.อภินวฏี. 1. ,วินยสงฺคหอภินวฏีกา 2 วินยาลงฺการฎีกา 2 นาม (มรมฺมรฏฺฐเตปิฏกาลงฺการ(ตองลาภี)) - วินยสงฺคห.อภินวฏี. 2. ".split(","),
	"null ,เนตฺติปกรณปาฬิ (กจฺจานมหาเถร(กจฺจายนมหาเถร)) - เนตฺติ. ,เนตฺติปกรณ-อฏฺฐกถา เนตฺติ-อฏฺฐกถา (ธมฺมปาล) - เนตฺติ.อฏฺ. ,เนตฺติปกรณ-ปุราณฏีกา เนตฺติปุราณฏีกา (ธมฺมปาล) - เนตฺติ.ปุราณฏี. ,เนตฺติปกรณ-วิภาวินีฏีกา เนตฺติวิภาวินีฏีกา (มรมฺมรฏฺฐสทฺธมฺมปาลสิริมหาธมฺมราชคุรุ) - เนตฺติ.วิภาวินีฏี. ,วิสุทฺธิมคฺค-อฏฺฐกถา 1 ปุริมจตุนิกาย-อฏฺฐกถา 1 (พุทฺธโฆส) - วิสุทฺธิ. 1 ,วิสุทฺธิมคฺค-อฏฺฐกถา 1 ปุริมจตุนิกาย-อฏฺฐกถา 2 (พุทฺธโฆส) - วิสุทฺธิ. 2 ,วิสุทฺธิมคฺค-มหาฏีกา 1 ปรมตฺถมญฺชูสา 1 นาม (ธมฺมปาล) - วิสุทฺธิ.มหาฏี 1 ,วิสุทฺธิมคฺค-มหาฏีกา 2 ปรมตฺถมญฺชูสา 2 นาม (ธมฺมปาล) - วิสุทฺธิ.มหาฏี 2 ,วิสุทฺธิมคฺคนิทานกถา พุทฺธโฆสวตฺถุกถา จ อฏฺฐกถานิทานกถา จ ( ฉฏฺฐสงฺคีติภารนิตฺถารกสงฺฆสมิติ) - วิสุทฺธิ.นิทาน. ".split(","),
	"null ,อภิธมฺมาวตาร-สงฺเขปอฏฺฐกถา (พุทฺธทตฺต) - อภิธมฺมาวตาร. ,อภิธมฺมาวตาร-ปุราณฏีกา (วาจิสฺสตฺมหาสามิ) - ปุราณฏี. ,อภิธมฺมาวตารอภินวฏีกา 1 อภิธมฺมตฺถวิกาสินี 1 นาม (สุมงฺคลมหาสามิ) - อภิธมฺมาวตาร.อภินวฏี. 1. ,อภิธมฺมาวตารอภินวฏีกา 2 อภิธมฺมตฺถวิกาสินี 2 นาม (สุมงฺคลมหาสามิ) - อภิธมฺมาวตาร.อภินวฏี. 2. ,นามรูปปริจฺเฉท-สงฺเขปอฏฺฐกถา (อนุรุทฺธ) - นามรูปปริจฺเฉท. ,ปรมตฺถวินิจฺฉย-สงฺเขปอฏฺฐกถา (อนุรุทฺธ) - ปรมตฺถวินิจฺฉย. ,อภิธมฺมตฺถสงฺคห-สงฺเขปอฏฺฐกถา (อนุรุทฺธ) - สงฺคห. ,อภิธมฺมตฺถสงฺคหฏีกา อภิธมฺมตฺถวิภาวินีฏีกา นาม (สุมงฺคลมหาสามิ) - สงฺคห.วิภาวินีฏี. ,สจฺจสงฺเขป-สงฺเขปอฏฺฐกถา (จูฬธมฺมปาล) - สจฺจสงฺเขป. ,อภิธมฺมตฺถสงฺคหฏีกา ปรมตฺถทีปนี นาม (มรมฺมรฏฺฐเลตี) - สงฺคห.ปรมตฺถทีปนีฏี. ,อภิธมฺมตฺถสงฺคหฏีกาย ปรมตฺถทีปนิยา ฏีกา อนุทีปนี นาม (มรมฺมรฏฺฐเลตี) - สงฺคห.อนุทีปนีฏี. ,ปฏฺฐานสงฺคหฏีกา ปฏฺฐานุทฺเทสทีปนี นาม (มรมฺมรฏฺฐเลตี) - ปฏฺฐานุทฺเทสทีปนี. ,อภิธมฺมมาติกา-อฏฺฐกถา โมหวิจฺเฉทนี นาม (โจฬรฏฺฐกสฺสป) - โมหวิจฺเฉทนี. ".split(","),
	"".split(","),
	"null ,วินยปิฏก มหาวิภงฺคปาฬิ 1 - วิ.มหา.แปล. ,วินยปิฏก มหาวิภงฺคปาฬิ 2 - วิ.มหา.แปล. ,วินยปิฏก ภิกฺขุนีวิภงฺคปาฬิ - วิ.ภิกฺขุนี.แปล. ,วินยปิฏก มหาวคฺคปาฬิ 1 - วิ.ม.แปล. ,วินยปิฏก มหาวคฺคปาฬิ 2 - วิ.ม.แปล. ,วินยปิฏก จูฬวคฺคปาฬิ 1 - วิ.จู.แปล. ,วินยปิฏก จูฬวคฺคปาฬิ 2 - วิ.จู.แปล. ,วินยปิฏก ปริวารปาฬิ (อุปาลิมหาเถร) - วิ.ป.แปล. ,ทีฆนิกาย สีลกฺขนฺธวคฺคปาฬิ - ที.สี.แปล. ,ทีฆนิกาย มหาวคฺคปาฬิ - ที.ม.แปล. ,ทีฆนิกาย ปาฏิกวคฺคปาฬิ - ที.ปา.แปล. ,มชฺฌิมนิกาย มูลปณฺณาสกปาฬิ - ม.มู.แปล. ,มชฺฌิมนิกาย มชฺฌิมปณฺณาสกปาฬิ - ม.ม.แปล. ,มชฺฌิมนิกาย อุปริปณฺณาสกปาฬิ - ม.อุ.แปล. ,สํยุตฺตนิกาย สคาถวคฺคปาฬิ - สํ.ส.แปล. ,สํยุตฺตนิกาย นิทานวคฺคปาฬิ - สํ.นิ.แปล. ,สํยุตฺตนิกาย ขนฺธวารวคฺคปาฬิ - สํ.ข.แปล. ,สํยุตฺตนิกาย สฬายตนวคฺคปาฬิ - สํ.สฬา.แปล. ,สํยุตฺตนิกาย มหาวารวคฺคปาฬิ - สํ.ม.แปล. ,องฺคุตฺตรนิกาย เอกกนิปาตปาฬิ - องฺ.เอกก.แปล. + องฺคุตฺตรนิกาย ทุกนิปาตปาฬิ - องฺ.ทุก.แปล. + องฺคุตฺตรนิกาย ติกนิปาตปาฬิ - องฺ.ติก.แปล. ,องฺคุตฺตรนิกาย จตุกฺกนิปาตปาฬิ - องฺ.จตุกฺก.แปล. ,องฺคุตฺตรนิกาย ปญฺจกนิปาตปาฬิ - องฺ.ปญฺจก.แปล. + องฺคุตฺตรนิกาย ฉกฺกนิปาตปาฬิ - องฺ.ฉกฺก.แปล. ,องฺคุตฺตรนิกาย สตฺตกนิปาตปาฬิ - องฺ.สตฺตก.แปล. + องฺคุตฺตรนิกาย อฏฺฐกนิปาตปาฬิ - องฺ.อฏฺฐก.แปล. + องฺคุตฺตรนิกาย นวกนิปาตปาฬิ - องฺ.นวก.แปล. ,องฺคุตฺตรนิกาย ทสกนิปาตปาฬิ - องฺ.ทสก.แปล. + องฺคุตฺตรนิกาย เอกาทสกนิปาตปาฬิ - องฺ.เอกาทสก.แปล. ,ขุทฺทกนิกาย ขุทฺทกปาฐปาฬิ - ขุ.ขุ.แปล. + ขุทฺทกนิกาย ธมฺมปทปาฬิ - ขุ.ธ.แปล. + ขุทฺทกนิกาย อุทานปาฬิ - ขุ.อุ.แปล. + ขุทฺทกนิกาย อิติวุตฺตกปาฬิ - ขุ.อิติ.แปล. + ขุทฺทกนิกาย สุตฺตนิปาตปาฬิ - ขุ.สุ.แปล. ,ขุทฺทกนิกาย วิมานวตฺถุปาฬิ - ขุ.วิ.แปล. + ขุทฺทกนิกาย เปตวตฺถุปาฬิ - ขุ.เปต.แปล. + ขุทฺทกนิกาย เถรคาถาปาฬิ - ขุ.เถร.แปล. + ขุทฺทกนิกาย เถรีคาถาปาฬิ - ขุ.เถรี.แปล. ,ขุทฺทกนิกาย ชาตกปาฬิ 1 - ขุ.ชา.แปล. ,ขุทฺทกนิกาย ชาตกปาฬิ 2 - ขุ.ชา.แปล. ,ขุทฺทกนิกาย มหานิทฺเทสปาฬิ (สาริปุตฺตมหาเถร) - ขุ.ม.แปล. ,ขุทฺทกนิกาย จูฬนิทฺเทสปาฬิ (สาริปุตฺตมหาเถร) - ขุ.จู.แปล. ,ขุทฺทกนิกาย ปฏิสมฺภิทามคฺคปาฬิ (สาริปุตฺตมหาเถร) - ขุ.ป.แปล. ,ขุทฺทกนิกาย อปทานปาฬิ 1 - ขุ.อป.แปล. ,ขุทฺทกนิกาย อปทานปาฬิ 2 - ขุ.อป.แปล. + ขุทฺทกนิกาย พุทฺธวํสปาฬิ - ขุ.พุทฺธ.แปล. + ขุทฺทกนิกาย จริยาปิฏกปาฬิ - ขุ.จริยา.แปล. ,อภิธมฺมปิฏก ธมฺมสงฺคณิปาฬิ - อภิ.สงฺ.แปล. ,อภิธมฺมปิฏก วิภงฺคปาฬิ - อภิ.วิ.แปล. ,อภิธมฺมปิฏก ธาตุกถาปาฬิ - อภิ.ธา.แปล. + อภิธมฺมปิฏก ปุคฺคลปญฺญตฺติปาฬิ - อภิ.ปุ.แปล. ,อภิธมฺมปิฏก กถาวตฺถุปาฬิ - อภิ.ก.แปล. ,อภิธมฺมปิฏก ยมกปาฬิ 1 - อภิ.ย.แปล. ,อภิธมฺมปิฏก ยมกปาฬิ 2 - อภิ.ย.แปล. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 1 - อภิ.ป.แปล. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 2 - อภิ.ป.แปล. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 3 - อภิ.ป.แปล. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 4 - อภิ.ป.แปล. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 5 - อภิ.ป.แปล. ,อภิธมฺมปิฏก ปฏฺฐานปาฬิ 6 - อภิ.ป.แปล. ".split(","),
	"null ,สมนฺตปาสาทิกา-อฏฐถกถา 1 มหาวิภงฺค-อฏฐถกถา ปาราชิกกณฺฑ-อฏฺฐกถา ปาราชิกกณฺฑนฺตา (พุทฺธโฆส) - วิ.อฏฺ. 1. ,สมนฺตปาสาทิกา-อฏฐถกถา 2 มหาวิภงฺค-อฏฐถกถา 2 สงฺฆาทิเสสกณฺฑาทโย (พุทฺธโฆส) - วิ.อฏฺ. 2. + สมนฺตปาสาทิกา-อฏฐถกถา 2 ภิกฺขุนีวิภงค-อฏฺฐกถา (พุทฺธโฆส) - วิ.อฏฺ. 2. ,สมนฺตปาสาทิกา-อฏฐถกถา 3 มหาวคฺค(วิ)-อฏฺฐกถา (พุทฺธโฆส) - วิ.อฏฺ. 3. + สมนฺตปาสาทิกา-อฏฐถกถา 3 จูฬวคฺค-อฏฺฐกถา (พุทฺธโฆส) - วิ.อฏฺ. 3. + สมนฺตปาสาทิกา-อฏฐถกถา 3 ปริวารวคฺค-อฏฺฐกถา (พุทฺธโฆส) - วิ.อฏฺ. 3. ,สุมงฺคลวิลาสินี-อฏฐถกถา 1 สีลกฺขนฺธวคฺค-อฏฺฐกถา (พุทฺธโฆส) - ที.อฏฺ. 1. ,สุมงฺคลวิลาสินี-อฏฐถกถา 2 มหาวคฺค-อฏฺฐกถา(ที.) (พุทฺธโฆส) - ที.อฏฺ. 2. ,สุมงฺคลวิลาสินี-อฏฐถกถา 3 ปาถิกวคฺค-อฏฺฐกถา (พุทฺธโฆส) - ที.อฏฺ. 3. ,ปปญฺจสูทนี-อฏฐถกถา 1 มูลปณฺณาสก-อฏฺฐกถา 1 (พุทฺธโฆส) - ม.อฏฺ. 1(1). ,ปปญฺจสูทนี-อฏฐถกถา 1 มูลปณฺณาสก-อฏฺฐกถา 2 (พุทฺธโฆส) - ม.อฏฺ. 1(2). ,ปปญฺจสูทนี-อฏฐถกถา 2 มชฺฌิมปณฺณาสก-อฏฺฐกถา (พุทฺธโฆส) - ม.อฏฺ. 2. ,ปปญฺจสูทนี-อฏฐถกถา 3 อุปริปณฺณาสก-อฏฺฐกถา (พุทฺธโฆส) - ม.อฏฺ. 3. ,สารตฺถปฺปกาสินี-อฏฐถกถา 1 สคาถวคฺค-อฏฺฐกถา (พุทฺธโฆส) - สํ.อฏฺ. 1. ,สารตฺถปฺปกาสินี-อฏฐถกถา 2 นิทานวคฺค-อฏฺฐกถา (พุทฺธโฆส) - สํ.อฏฺ. 2(1). ,สารตฺถปฺปกาสินี-อฏฐถกถา 2 ขนฺธวคฺค-อฏฺฐกถา (พุทฺธโฆส) - สํ.อฏฺ. 2(2). ,สารตฺถปฺปกาสินี-อฏฐถกถา 3 สฬายตนวคฺค-อฏฺฐกถา (พุทฺธโฆส) - สํ.อฏฺ. 3(1). ,สารตฺถปฺปกาสินี-อฏฐกถา 3 มหาวารวคฺค-อฏฺฐกถา(สํ) (พุทฺธโฆส) - สํ.อฏฺ. 3(2). ,มโนรถปูรณี-อฏฐกถา 1 เอกกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 1. ,มโนรถปูรณี-อฏฐกถา 2 ทุกนิปาต--อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 2. + มโนรถปูรณี-อฏฐกถา 2 ติกนิปาต--อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 2. + มโนรถปูรณี-อฏฐกถา 2 จตุกฺกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 2. ,มโนรถปูรณี-อฏฐกถา 3 ปญฺจกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 ฉกฺกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 สตฺตกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 อฏฺฐกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 นวกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 ทสกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. + มโนรถปูรณี-อฏฐกถา 3 เอกาทสกนิปาต-อฏฺฐกถา (พุทฺธโฆส) - องฺ.อฏฺ. 3. ,ปรมตฺถโชติกา ขุทฺทกปาฐ-อฏฺฐกถา (พุทฺธโฆส) - ขุ.ขุทฺทก.อฏฺ. ,ธมฺมปท-อฏฺฐกถา 1-4 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ธมฺม.อฏฺ. 1-4. ,ธมฺมปท-อฏฺฐกถา 5-8 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ธมฺม.อฏฺ. 5-8. ,ปรมตฺถทีปนี อุทาน-อฏฺฐกถา (ธมฺมปาล) - ขุ.อุ.อฏฺ. ,ปรมตฺถทีปนี อิติวุตฺตก-อฏฺฐกถา (ธมฺมปาล) - ขุ.อิ.อฏฺ. ,ปรมตฺถโชติกา สุตฺตนิปาต-อฏฺฐกถา 1 (พุทฺธโฆส) - ขุ.สุ.อฏฺ. 1. ,ปรมตฺถโชติกา สุตฺตนิปาต-อฏฺฐกถา 2 (พุทฺธโฆส) - ขุ.สุ.อฏฺ. 2. ,วิมานวตฺถุ-อฏฺฐกถา (ธมฺมปาล) - ขุ.วิ.อฏฺ. ,เปตวตฺถุ-อฏฺฐกถา (ธมฺมปาล) - ขุ.เปต.อฏฺ. ,ปรมตฺถทีปนี เถรคาถา-อฏฺฐกถา 1 (ธมฺมปาล) - ขุ.เถร.อฏฺ. 1. ,ปรมตฺถทีปนี เถรคาถา-อฏฺฐกถา 2 (ธมฺมปาล) - ขุ.เถร.อฏฺ. 2. ,ปรมตฺถทีปนี เถรีคาถา-อฏฺฐกถา (ธมฺมปาล) - ขุ.เถรี.อฏฺ. ,ชาตก-อฏฺฐกถา 1 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 1. ,ชาตก-อฏฺฐกถา 2 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 2. ,ชาตก-อฏฺฐกถา 3 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 3. ,ชาตก-อฏฺฐกถา 4 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 4. ,ชาตก-อฏฺฐกถา 5 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 5. ,ชาตก-อฏฺฐกถา 6 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 6. ,ชาตก-อฏฺฐกถา 7 (พุทฺธโฆส - เกหิจิ นุ โข คเณหิ สห รจิตา) - ขุ.ชา.อฏฺ. 7. ,สทฺธมฺมปฺปชฺโชติกา มหานิทฺเทส-อฏฺฐกถา (อุปเสน) - ขุ.มหา.อฏฺ. ,สทฺธมฺมปฺปชฺโชติกา จูฬนิทฺเทส-อฏฺฐกถา (อุปเสน) - ขุ.จูฬ.อฏฺ. ,สทฺธมฺมปฺปกาสินี 1 ปฏิสมฺภิทามคฺค-อฏฺฐกถา (มหานาม) - ขุ.ปฏิ.อฏฺ. 1. ,สทฺธมฺมปฺปกาสินี 2 ปฏิสมฺภิทามคฺค-อฏฺฐกถา (มหานาม) - ขุ.ปฏิ.อฏฺ. 2. ,วิสุทฺธชนวิลาสินี 1 อปทาน-อฏฺฐกถา - ขุ.อป.อฏฺ. 1. ,วิสุทฺธชนวิลาสินี 2 อปทาน-อฏฺฐกถา - ขุ.อป.อฏฺ. 2. ,ปรมตฺถทีปนี จริยาปิฏก-อฏฺฐกถา (ธมฺมปาล) - ขุ.จริยา.อฏฺ. ,มธุรตฺถวิลาสินี พุทฺธวํส-อฏฺฐกถา (พุทฺธทตฺต) - ขุ.พุทฺธ.อฏฺ. ,อฏฺฐสาลินี ธมฺมสงฺคณิ-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 1. ,สมฺโมหวิโนทนี วิภงฺค-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 2. ,ปรมตฺถทีปนี ปญฺจปฺปกรณ-อฏฺฐกถา ธาตุกถา-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 3. +ปรมตฺถทีปนี ปญฺจปฺปกรณ-อฏฺฐกถา ปุคฺคลปญฺญตฺติ-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 3. + ปรมตฺถทีปนี ปญฺจปฺปกรณ-อฏฺฐกถา กถาวตฺถุ-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 3. + ปรมตฺถทีปนี ปญฺจปฺปกรณ-อฏฺฐกถา ยมกปฺปกรณ-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 3. + ปรมตฺถทีปนี ปญฺจปฺปกรณ-อฏฺฐกถา ปฏฺฐานปฺปกรณ-อฏฺฐกถา (พุทฺธโฆส) - อภิ.อฏฺ. 3. ".split(","),
	"null ,สารตฺถทีปนี 1 มหาวิภงฺคฏีกา 1 ปาราชิกกณฺฑนฺตา (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 1. ,สารตฺถทีปนี 2 มหาวิภงฺคฏีกา 2 นิสฺสคฺคิยกณฺฑนฺตาโย (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 2. ,สารตฺถทีปนี 3 มหาวิภงฺคฏีกา 3 ปาจิตฺติยกณฺฑาทโย (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 3. + สารตฺถทีปนี 3 ภิกฺขุนีวิภงฺคฏีกา (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 3. + สารตฺถทีปนี 3 มหาวคฺคฏีกา (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 3. + สารตฺถทีปนี 3 จูฬวคฺคฏีกา (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 3. + สารตฺถทีปนี 3 ปริวารวคฺคฏีกา (สารีปุตฺต) - วิ.สารตฺถทีปนีฏี. 3. ,วชิรพุทฺธิฏีกา มหาวิภงฺคฏีกา (วชิรพุทฺธิ) - วิ.วชิรพุทฺธิฏี. + วชิรพุทฺธิฏีกา ภิกฺขุนีวิภงฺคฏีกา (วชิรพุทฺธิ) - วิ.วชิรพุทฺธิฏี. + วชิรพุทฺธิฏีกา มหาวคฺคฏีกา (วชิรพุทฺธิ) - วิ.วชิรพุทฺธิฏี. + วชิรพุทฺธิฏีกา จูฬวคฺคฏีกา (วชิรพุทฺธิ) - วิ.วชิรพุทฺธิฏี. + วชิรพุทฺธิฏีกา ปริวารวคฺคฏีกา (วชิรพุทฺธิ) - วิ.วชิรพุทฺธิฏี. ,วิมติวิโนทนีฏีกา 1 มหาวิภงฺคฏีกา นิสฺสคฺคิยกณฺฑนฺตาโย (โจฬรฏฺฐกสฺสป) - .วิมติวิโนทนีฏี. 1. ,วิมติวิโนทนีฏีกา 2 มหาวิภงฺคฏีกา ปาจิตฺติยกณฺฑาทโย (โจฬรฏฺฐกสฺสป) - วิ.วิมติวิโนทนีฏี. 2. + วิมติวิโนทนีฏีกา 2 ภิกฺขุนีวิภงฺคฏีกา (โจฬรฏฺฐกสฺสป) - วิ.วิมติวิโนทนีฏี. 2. + วิมติวิโนทนีฏีกา 2 มหาวคฺคฏีกา (โจฬรฏฺฐกสฺสป) - วิ.วิมติวิโนทนีฏี. 2. + วิมติวิโนทนีฏีกา 2 จูฬวคฺคฏีกา (โจฬรฏฺฐกสฺสป) - วิ.วิมติวิโนทนีฏี. 2. + วิมติวิโนทนีฏีกา 2 ปริวารฏีกา (โจฬรฏฺฐกสฺสป) - วิ.วิมติวิโนทนีฏี. 2. ,ปาจิตฺยาทิโยชนา มหาวิภงฺคโยชนา (มรมฺมรฏฺฐชาคร) - วิ.ปาจิตฺยาทิโยชนา. + ปาจิตฺยาทิโยชนา ภิกฺขุนีวิภงฺคโยชนา (มรมฺมรฏฺฐชาคร) - วิ.ปาจิตฺยาทิโยชนา. + ปาจิตฺยาทิโยชนา มหาวคฺคโยชนา (มรมฺมรฏฺฐชาคร) - วิ.ปาจิตฺยาทิโยชนา. + ปาจิตฺยาทิโยชนา จูฬวคฺคโยชนา (มรมฺมรฏฺฐชาคร) - วิ.ปาจิตฺยาทิโยชนา. + ปาจิตฺยาทิโยชนา ปริวารโยชนา (มรมฺมรฏฺฐชาคร) - วิ.ปาจิตฺยาทิโยชนา. ,ลีนตฺถปฺปกาสนา 1 สีลกฺขนฺธวคฺคฏีกา (ธมฺมปาล) - ที.ฏี. 1. ,ลีนตฺถปฺปกาสนา 2 มหาวคฺคฏีกา (ธมฺมปาล) - ที.ฏี. 2. ,ลีนตฺถปฺปกาสนา 3 ปาถิกวคฺคฏีกา (ธมฺมปาล) - ที.ฏี. 3. ,สาธุวิลาสินี 1 สีลกฺขนฺธวคฺคอภินวฏีกา 1 (มรมฺมรฏฺฐญาณาภิวํสธมฺมเสนาปติ) - ที.สี.อภินวฏี. 1. ,สาธุวิลาสินี 2 สีลกฺขนฺธวคฺคอภินวฏีกา 2 (มรมฺมรฏฺฐญาณาภิวํสธมฺมเสนาปติ) - ที.สี.อภินวฏี. 2. ,ลีนตฺถปฺปกาสนา 1 มูลปณฺณาสกฏีกา 1 (ธมฺมปาล) - ม.ฏี. 1(1). ,ลีนตฺถปฺปกาสนา 1 มูลปณฺณาสกฏีกา 2 (ธมฺมปาล) - ม.ฏี. 1(2). ,ลีนตฺถปฺปกาสนา 2 มชฺฌิมปณฺณาสกฏีกา (ธมฺมปาล) - ม.ฏี. 2. ,ลีนตฺถปฺปกาสนา 3 อุปริปณฺณาสกฏีกา (ธมฺมปาล) - ม.ฏี. 3. ,ลีนตฺถปฺปกาสนา 1 สคาถวคฺคฏีกา (ธมฺมปาล) - สํ.ฏี. 1. ,ลีนตฺถปฺปกาสนา 2 นิทานวคฺคฏีกา (ธมฺมปาล) - สํ.ฏี. 2(1). ,ลีนตฺถปฺปกาสนา 2 ขนฺธวคฺคฏีกา (ธมฺมปาล) - สํ.ฏี. 2(2). ,ลีนตฺถปฺปกาสนา 3 สฬายตนวคฺคฏีกา (ธมฺมปาล) - สํ.ฏี. 3(1). ,ลีนตฺถปฺปกาสนา 3 มหาวคฺคฏีกา(สํ) (ธมฺมปาล) - สํ.ฏี. 3(2). ,สารตฺถมญฺชูสา 1 องฺคุตฺตรนิกายฏีกา เอกกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. ,สารตฺถมญฺชูสา 2 องฺคุตฺตรนิกายฏีกา ทุกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 2 ติกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 2 จตุกฺกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. ,สารตฺถมญฺชูสา 3 องฺคุตฺตรนิกายฏีกา ปญฺจกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 ฉกฺกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 สตฺตกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 อฏฺฐกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 นวกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 ทสกนิปาตฏีกา (สารีปุตฺต) - องฺ.ฏี. 2. + สารตฺถมญฺชูสา 3 เอกาทสกฏีกา (สารีปุตฺต) - องฺ.ฏี. 3. ,อสมฺโมหวิลาสินี 1 ชาตก-อภินวฏีกา เอกกนิปาตฏีกา 1 -ขุ.ชา.เอกก.ฏี. 1. ,อสมฺโมหวิลาสินี 2 ชาตก-อภินวฏีกา เอกกนิปาตฏีกา 2 - ขุ.ชา.เอกก.ฏี. 2. ,อสมฺโมหวิลาสินี 3 ชาตก-อภินวฏีกา ทุกนิปาตฏีกา - ขุ.ชา.ทุก.ฏี. 3. ,อสมฺโมหวิลาสินี 4 ชาตก-อภินวฏีกา ติกนิปาตฏีกา - ขุ.ชา.ฏี. 4. + อสมฺโมหวิลาสินี 4 จตุกฺกนิปาตฏีกา - ขุ.ชา.ฏี. 4. + อสมฺโมหวิลาสินี 4 ชาตก-อภินวฏีกา ปญฺจกนิปาตฏีกา - ขุ.ชา.ฏี. 4. + อสมฺโมหวิลาสินี 4 ชาตก-อภินวฏีกา ฉกฺกนิปาตฏีกา - ขุ.ชา.ฏี. 4. ,มูลฏีกา 1 ธมฺมสงฺคณิ-มูลฏีกา (อานนฺท) - อภิ.มูลฏี. 1. ,ลีนตฺถวณฺณนา 1 ธมฺมสงฺคณิ-อนุฏีกา (ธมฺมปาล) - อภิ.อนุฏี. 1. ,มูลฏีกา 2 วิภงฺคมูลฏีกา (อานนฺท) - อภิ.มูลฏี. 2. ,ลีนตฺถวณฺณนา 2 วิภงฺค-อนุฏีกา (ธมฺมปาล) - อภิ.อนุฏี. 2. ,มูลฏีกา 3 ปญฺจปฺปกรณ-มูลฏีกา (อานนฺท) - อภิ.มูลฏี. 3. ,ลีนตฺถวณฺณนา 3 ปญฺจปฺปกรณ-อนุฏีกา (ธมฺมปาล) - อภิ.อนุฏี. 3. ".split(",")
	);

TDBn= new Array("","1 พระวินัยปิฎก มหาวิภังค์ เล่ม 1 ภาค 1 ", "2 พระวินัยปิฎก มหาวิภังค์ เล่ม 1 ภาค 2 ", "3 พระวินัยปิฎก มหาวิภังค์ เล่ม 1 ภาค 3 ", "4 พระวินัยปิฎก มหาวิภังค์ เล่ม 2 ", "5 พระวินัยปิฎก ภิกขุนีวิภังค์ เล่ม 3 ", "6 พระวินัยปิฎก มหาวรรค เล่ม 4 ภาค 1 ", "7 พระวินัยปิฎก มหาวรรค เล่ม 5 ภาค 2 ", "8 พระวินัยปิฎก จุลวรรค เล่ม 6 ภาค 1 ", "9 พระวินัยปิฎก จุลวรรค เล่ม 7 ภาค 2 ", "10 พระวินัยปิฎก ปริวาร เล่ม 8 ", "11 พระสุตตันตปิฎก ทีฆนิกาย สีลขันธวรรค เล่ม 1 ภาค 1 ", "12 พระสุตตันตปิฎก ทีฆนิกาย สีลขันธวรรค เล่ม 1 ภาค 2 ", "13 พระสุตตันตปิฎก ทีฆนิกาย มหาวรรค เล่ม 2 ภาค 1 ", "14 พระสุตตันตปิฎก ทีฆนิกาย มหาวรรค เล่ม 2 ภาค 2 ", "15 พระสุตตันตปิฎก ทีฆนิกาย ปาฏิกวรรค เล่ม 3 ภาค 1 ", "16 พระสุตตันตปิฎก ทีฆนิกาย ปาฏิกวรรค เล่ม 3 ภาค 2 ", "17 พระสุตตันตปิฎก มัชฌิมนิกาย มูลปัณณาสก์ เล่ม 1 ภาค 1 ", "18 พระสุตตันตปิฎก มัชฌิมนิกาย มูลปัณณาสก์ เล่ม 1 ภาค 2 ", "19 พระสุตตันตปิฎก มัชฌิมนิกาย มูลปัณณาสก์ เล่ม 1 ภาค 3 ", "20 พระสุตตันตปิฎก มัชฌิมนิกาย มัชฌิมปัณณาสก์ เล่ม 2 ภาค 1 ", "21 พระสุตตันตปิฎก มัชฌิมนิกาย มัชฌิมปัณณาสก์ เล่ม 2 ภาค 2 ", "22 พระสุตตันตปิฎก มัชฌิมนิกาย อุปริปัณณาสก์ เล่ม 3 ภาค 1 ", "23 พระสุตตันตปิฎก มัชฌิมนิกาย อุปริปัณณาสก์ เล่ม 3 ภาค 2 ", "24 พระสุตตันตปิฎก สังยุตตนิกาย สคาถวรรค เล่ม 1 ภาค 1 ", "25 พระสุตตันตปิฎก สังยุตตนิกาย สคาถวรรค เล่ม 1 ภาค 2 ", "26 พระสุตตันตปิฎก สังยุตตนิกาย นิทานวรรค เล่ม 2 ", "27 พระสุตตันตปิฎก สังยุตตนิกาย ขันธวารวรรค เล่ม 3 ", "28 พระสุตตันตปิฎก สังยุตตนิกาย สฬายตนวรรค เล่ม 4 ภาค 1 ", "29 พระสุตตันตปิฎก สังยุตตนิกาย สฬายตนวรรค เล่ม 4 ภาค 2 ", "30 พระสุตตันตปิฎก สังยุตตนิกาย มหาวารวรรค เล่ม 5 ภาค 1 ", "31 พระสุตตันตปิฎก สังยุตตนิกาย มหาวารวรรค เล่ม 5 ภาค 2 ", "32 พระสุตตันตปิฎก อังคุตรนิกาย เอกนิบาต เล่ม 1 ภาค 1 ", "33 พระสุตตันตปิฎก เอกนิบาต-ทุกนิบาต เล่ม 1 ภาค 2 ", "34 พระสุตตันตปิฎก อังคุตรนิกาย ติกนิบาต เล่ม 1 ภาค 3 ", "35 พระสุตตันตปิฎก อังคุตรนิกาย จตุกนิบาต เล่ม 2 ", "36 พระสุตตันตปิฎก อังคุตรนิกาย ปัญจก-ฉักกนิบาต เล่ม 3 ", "37 พระสุตตันตปิฎก อังคุตรนิกาย สัตตก-อัฏฐก-นวกนิบาต เล่ม 4 ", "38 พระสุตตันตปิฎก อังคุตรนิกาย ทสก-เอกาทสกนิบาต เล่ม 5 ", "39 พระสุตตันตปิฎก ขุททกนิกาย ขุททกปาฐะ เล่ม 1 ภาค 1 ", "40 พระสุตตันตปิฎก ขุททกนิกาย คาถาธรรมบท เล่ม 1 ภาค 2 ตอน 1 ", "41 พระสุตตันตปิฎก ขุททกนิกาย คาถาธรรมบท เล่ม 1 ภาค 2 ตอน 2 ", "42 พระสุตตันตปิฎก ขุททกนิกาย คาถาธรรมบท เล่ม 1 ภาค 2 ตอน 3 ", "43 พระสุตตันตปิฎก ขุททกนิกาย คาถาธรรมบท เล่ม 1 ภาค 2 ตอน 4 ", "44 พระสุตตันตปิฎก ขุททกนิกาย อุทาน เล่ม 1 ภาค 3 ", "45 พระสุตตันตปิฎก ขุททกนิกาย อิติวุตตก เล่ม 1 ภาค 4 ", "46 พระสุตตันตปิฎก ขุททกนิกาย สุตตนิบาต เล่ม 1 ภาค 5 ", "47 พระสุตตันตปิฎก ขุททกนิกาย สุตตนิบาต เล่ม 1 ภาค 6 ", "48 พระสุตตันตปิฎก ขุททกนิกาย วิมานวัตถุ เล่ม 2 ภาค 1 ", "49 พระสุตตันตปิฎก ขุททกนิกาย เปตวัตถุ เล่ม 2 ภาค 2 ", "50 พระสุตตันตปิฎก ขุททกนิกาย เถรคาถา เล่ม 2 ภาค 3 ตอน 1 ", "51 พระสุตตันตปิฎก ขุททกนิกาย เถรคาถา เล่ม 2 ภาค 3 ตอน 2 ", "52 พระสุตตันตปิฎก ขุททกนิกาย เถรคาถา เล่ม 2 ภาค 3 ตอน 3 ", "53 พระสุตตันตปิฎก ขุททกนิกาย เถรคาถา เล่ม 2 ภาค 3 ตอน 4 ", "54 พระสุตตันตปิฎก ขุททกนิกาย เถรีคาถา เล่ม 2 ภาค 4 ", "55 พระสุตตันตปิฎก ขุททกนิกาย ชาดก เล่ม 3 ภาค 1 ", "56 พระสุตตันตปิฎก ขุททกนิกาย เอกนิบาตชาดก เล่ม 3 ภาค 2 ", "57 พระสุตตันตปิฎก ขุททกนิกาย ทุกนิบาตชาดก เล่ม 3 ภาค 3 ", "58 พระสุตตันตปิฎก ขุททกนิกาย ชาดก เล่ม 3 ภาค 4 ", "59 พระสุตตันตปิฎก ขุททกนิกาย ชาดก เล่ม 3 ภาค 5 ", "60 พระสุตตันตปิฎก ขุททกนิกาย ชาดก เล่ม 3 ภาค 6 ", "61 พระสุตตันตปิฎก ขุททกนิกาย ชาดก เล่ม 3 ภาค 7 ", "62 พระสุตตันตปิฎก ขุททกนิกาย ชาดก เล่ม 4 ภาค 1 ", "63 พระสุตตันตปิฎก ขุททกนิกาย ชาดก เล่ม 4 ภาค 2 ", "64 พระสุตตันตปิฎก ขุททกนิกาย ชาดก เล่ม 4 ภาค 3 ", "65 พระสุตตันตปิฎก ขุททกนิกาย มหานิทเทส เล่ม 5 ภาค 1 ", "66 พระสุตตันตปิฎก ขุททกนิกาย มหานิทเทส เล่ม 5 ภาค 2 ", "67 พระสุตตันตปิฎก ขุททกนิกาย จูฬนิเทส เล่ม 6 ", "68 พระสุตตันตปิฎก ขุททกนิกาย ปฏิสัมภิทามรรค เล่ม 7 ภาค 1 ", "69 พระสุตตันตปิฎก ขุททกนิกาย ปฏิสัมภิทามรรค เล่ม 7 ภาค 2 ", "70 พระสุตตันตปิฎก ขุททกนิกาย อปทาน เล่ม 8 ภาค 1 ", "71 พระสุตตันตปิฎก ขุททกนิกาย อปทาน เล่ม 8 ภาค 2 ", "72 พระสุตตันตปิฎก ขุททกนิกาย อปทาน เล่ม 9 ภาค 1 ", "73 พระสุตตันตปิฎก ขุททกนิกาย พุทธวงศ์ เล่ม 9 ภาค 2 ", "74 พระสุตตันตปิฎก ขุททกนิกาย จริยาปิฎก เล่ม 9 ภาค 3 ", "75 พระอภิธรรมปิฎก ธรรมสังคณี เล่ม 1 ภาค 1 ", "76 พระอภิธรรมปิฎก ธรรมสังคณี เล่ม 1 ภาค 2 ", "77 พระอภิธรรมปิฎก วิภังค์ เล่ม 2 ภาค 1 ", "78 พระอภิธรรมปิฎก วิภังค์ เล่ม 2 ภาค 2 ", "79 พระอภิธรรมปิฎก ธาตุกถา-บุคคลบัญญัติ เล่ม 3 ", "80 พระอภิธรรมปิฎก กถาวัตถุ เล่ม 4 ภาค 1 ", "81 พระอภิธรรมปิฎก กถาวัตถุ เล่ม 4 ภาค 2 ", "82 พระอภิธรรมปิฎก ยมก เล่ม 5 ภาค 1 ตอน 1 ", "83 พระอภิธรรมปิฎก ยมก เล่ม 5 ภาค 1 ตอน 2 ", "84 พระอภิธรรมปิฎก ยมก เล่ม 6 ภาค 2 ", "85 พระอภิธรรมปิฎก ปัฏฐาน เล่ม 7 ภาค 1 ", "86 พระอภิธรรมปิฎก ปัฏฐาน เล่ม 7 ภาค 2 ", "87 พระอภิธรรมปิฎก ปัฏฐาน เล่ม 7 ภาค 3 ", "88 พระอภิธรรมปิฎก ปัฏฐาน เล่ม 7 ภาค 4 ", "89 พระอภิธรรมปิฎก ปัฏฐาน เล่ม 7 ภาค 5 ", "90 พระอภิธรรมปิฎก ปัฏฐาน เล่ม 7 ภาค 6 ", "91 พระอภิธรรมปิฎก ปัฏฐาน เล่ม 7 ภาค 7 ","มิลินฺทปญฺหา (ฉตฺตึสปญฺจสตทฺวิสหสฺสวสฺเส ทยฺยรฏฺฐมหาเถรสมาคเมน ปกาสิตา)","มิลินทปัญหา ฉบับมหาเถรสมาคมแห่งประเทศไทย ๒๕๓๖","วิสุทธิมรรคแปล เบอร์ ๑ ภาค ๑ ตอน ๑","วิสุทธิมรรคแปล เบอร์ ๒ ภาค ๑ ตอน ๒","วิสุทธิมรรคแปล เบอร์ ๓ ภาค ๒ ตอน ๑","วิสุทธิมรรคแปล เบอร์ ๔ ภาค ๒ ตอน ๒","วิสุทธิมรรคแปล เบอร์ ๓ ภาค ๓ ตอน ๑","วิสุทธิมรรคแปล เบอร์ ๓ ภาค ๓ ตอน ๒","อภิธมฺมตฺถสงฺคหปาลิยา สห อภิธมฺมตฺวิภาวินี นาม อภิธมฺมตฺถสงฺคหฏีกา","อภิธมฺมตฺถวิภาวินิยา ปญฺจิกา นาม อตฺถโยชนา (ปฐโม ภาโค)","อภิธมฺมตฺถวิภาวินิยา ปญฺจิกา นาม อตฺถโยชนา (ทุติโย ภาโค)","อภิธมฺมตฺถวิภาวินิยา ปญฺจิกา นาม อตฺถโยชนา (ตติโย ภาโค)","อภิธัมมัตถสังคหอรรถกถาและอภิธัมมัตถวิภาวีนีฎีกาแปล","มงฺคลตฺถทีปนี (ปฐโม ภาโค)","มงฺคลตฺถทีปนี (ทุติโย ภาโค)","มังคลัตถทีปนีแปล เล่ม ๑","มังคลัตถทีปนีแปล เล่ม ๒","มังคลัตถทีปนีแปล เล่ม ๓","มังคลัตถทีปนีแปล เล่ม ๔","มังคลัตถทีปนีแปล เล่ม ๕","สมนฺตปาสาทิกาวินยฏฺฐกถาย อตฺถโยชนา (ปฐโม ภาโค)","สมฺนฺตปาสาทิกาวินยฏฐกถาย อตฺถโยชนา (ทุติโย ภาโค)","บุพพสิกขาวรรณนา","พุทธธรรม (ฉบับปรับปรุง)","มนต์พิธี");

function ChkB(PDBp,col) {
	var str;
	for(var n1=1;n1<PDBp.length;n1++) {
	str=str+"<div id='tabc"+(n1)+"'><table width=95% >";
	for(var n=1;n<PDBp[n1].length;n++) {
	var chk=0;
		str=str+"<tr><td width=2% valign=top><font size=4 color=green>"+n+".</font></td><td> <label><font size=4 color=blue><input type=checkbox id=ibb name=ibb["+n1+"]["+n+"] value="+n1+""+n+" "; 
	if (col==0){
	}
	else if (col=="123321"){chk=1; }
	else if (col=="1234567" && n1<=7){chk=1; }
	else if (col=="8901234" && n1>=8){chk=1; }
	
	////หมวดพระวินัยปาฬิทั้งหมด
	else if (col=="00100") { 	if(n1==1){ 	if (n<=8) { 	chk=1; 	} 	} 	if(n1==2){ 	if ( n<=3) { 	chk=1; 	} 	} 	if(n1==3){ 	if ( n<=7) { 	chk=1; 	} 	} 	if(n1==4){ 	if (n<PDBp[4].length) { 	chk=1; 	} 	} 	
	//จบ
	}
	////หมวดพระสูตรปาฬิทั้งหมด
	else if (col=="00200") { 	if(n1==1){ 	if (n>=9 && n<=33) { 	chk=1; 	} 	} 	if(n1==2){ 	if (n>=4 && n<=45) { 	chk=1; 	} 	} 	if(n1==3){ 	if (n>=8 && n<=28) { 	chk=1; 	} 	} 	if(n1==5){ 	if (n<PDBp[5].length) { 	chk=1; 	} 	} 
	//จบ
	}
	////หมวดพระอภิธรรมปาฬิทั้งหมด
	else if (col=="00300") { 	if(n1==1){ 	if (n>=34 && n<=45) { 	chk=1; 	} 	} 	if(n1==2){ 	if (n>=46 && n<=48) { 	chk=1; 	} 	} 	if(n1==3){ 	if (n>=29 && n<=34) { 	chk=1; 	} 	} 	if(n1==6){ 	if (n<PDBp[6].length) { 	chk=1; 	} 	} 
	//จบ
	}
	////หมวดสังคหอรรถกถา-ฏีกาปาฬิทั้งหมด
	else if (col=="00400") { 	if(n1==4){ 	if (n<PDBp[4].length) { 	chk=1; 	} 	} 	if(n1==5){ 	if (n<PDBp[5].length) { 	chk=1; 	} 	} 	if(n1==6){ 	if (n<PDBp[6].length) { 	chk=1; 	} 	}
	//จบ
	}
	//วินัยแปลทั้งหมด
	else if (col=="00500") {	if(n1==8){ 	if ( n<=8) { 	chk=1; 	} 	} if(n1==9){ 	if (n<=3) { 	chk=1; 	} 	} if(n1==10){ 	if ( n<=7) { 	chk=1; 	} 	}
	}
	//พระสูตรแปลทั้งหมด
	else if (col=="00600") {	if(n1==8){ 	if (n>=9 && n<=33) { 	chk=1; 	} 	} 	if(n1==9){ 	if (n>=4 && n<=45) { 	chk=1; 	} 	} if(n1==10){ 	if (n>=8 && n<=28) { 	chk=1; 	} 	}	
	}
	//พระอภิธรรมแปลทั้งหมด
	else if (col=="00700") {	if(n1==8){ 	if (n>=34 && n<=45) { 	chk=1; 	} 	} 	if(n1==9){ 	if (n>=46 && n<=48) { 	chk=1; 	} 	} 	if(n1==10){ 	if (n>=29 && n<=34) { 	chk=1; 	} 	}
	}
		////หมวดสังคหอรรถกถา-ฏีกาปาฬิทั้งหมด
	else if (col=="00800") { 	if(n1==11){ 	if (n<PDBp[11].length) { 	chk=1; 	} 	} 	if(n1==12){ 	if (n<PDBp[12].length) { 	chk=1; 	} 	} 	if(n1==13){ 	if (n<PDBp[13].length) { 	chk=1; 	} 	}
	//จบ
	}

	//กรณี n1=1 (ค้นพระไตรปิฎก)
	else if 	(n1==1) { 	 	if ((col=="10")&&(n<PDBp[1].length)) { 	chk=1; 	} 	else	if ((col=="11")&&( n<=8)) { 	chk=1; 	} 	else	if ((col=="12")&&(n>=9 && n<=33)) { 	chk=1; 	} 	else	if ((col=="12222")&&(n>=9 && n<=24)) { 	chk=1; 	} 	else	if ((col=="121")&&(n>=9 && n<=11)) { 	chk=1; 	} 	else	if ((col=="122")&&(n>=12 && n<=14)) { 	chk=1; 	} 	else	if ((col=="123")&&(n>=15 && n<=19)) { 	chk=1; 	} 	else	if ((col=="124")&&(n>=20 && n<=24)) { 	chk=1; 	} 	else	if ((col=="125")&&(n>=25 && n<=33)) { 	chk=1; 	} 	else	if ((col=="1255")&&(n>=29 && n<=31)) { 	chk=1; 	} 	else	if ((col=="13")&&(n>=34 && n<=45)) { 	chk=1; 	}
	//จบ กรณี n1=1 (ค้นพระไตรปิฎก)
	}
	//อรรถกถาของพระไตรปิฎก
	 else if 	(n1==2) { 	 	 	if ((col=="20")&&(n<PDBp[2].length)) { 	chk=1; 	} 	else	if ((col=="21")&&( n<=3)) { 	chk=1; 	} 	else	if ((col=="22")&&(n>=4 && n<=45)) { 	chk=1; 	} 	else	if ((col=="22222")&&(n>=4 && n<=18)) { 	chk=1; 	} 	else	if ((col=="221")&&(n>=4 && n<=6)) { 	chk=1; 	}	 	else	if ((col=="222")&&(n>=7 && n<=10)) { 	chk=1; 	}	 	else	if ((col=="223")&&(n>=11 && n<=15)) { 	chk=1; 	} 	else	if ((col=="224")&&(n>=16 && n<=18)) { 	chk=1; 	} 	else	if ((col=="225")&&(n>=19 && n<=45)) { 	chk=1; 	} 	else	if ((col=="2251")&&(n>=20 && n<=21)) { 	chk=1; 	} 	else	if ((col=="2252")&&((n==19) || (n>=22 && n<=25))) { 	chk=1; 	} 	else	if ((col=="2253")&&(n>=26 && n<=27)) { 	chk=1; 	} 	else	if ((col=="2254")&&(n>=31 && n<=37)) { 	chk=1; 	} 	else	if ((col=="2255")&&(n>=38 && n<=41)) { 	chk=1; 	} 	else	if ((col=="2256")&&((n>=28 && n<=30) || (n>=42 && n<=45))) { 	chk=1; 	} 	else	if ((col=="23")&&(n>=46 && n<=48)) { 	chk=1; 	} 	}
	//ฏีกาของอรรถกถาพระไตรปิฎก
	 else if 	(n1==3) { 	 	 	if ((col=="30")&&( n<=n<PDBp[3].length)) { 	chk=1; 	} 	else	if ((col=="31")&&( n<=7)) { 	chk=1; 	} 	else	if ((col=="32")&&(n>=8 && n<=28)) { 	chk=1; 	} 	else	if ((col=="32222")&&(n>=8 && n<=24)) { 	chk=1; 	} 	else	if ((col=="321")&&(n>=8 && n<=12)) { 	chk=1; 	} 	else	if ((col=="322")&&(n>=13 && n<=16)) { 	chk=1; 	} 	else	if ((col=="323")&&(n>=17 && n<=21)) { 	chk=1; 	}
	//อํ.ฏี.
	else	if ((col=="324")&&(n>=22 && n<=24)) {chk=1;}
	//ชา.ฏี.
	else	if ((col=="3254")&&(n>=25 && n<=28)) {chk=1;}
	//อภิ.มู-อนุฏี.
	else	if ((col=="33")&&(n>=29 && n<=34)) {chk=1;}
	}
	//วินยสงฺคห อ.-ฏี.
	else if 	(n1==4) {
	if ((col=="40")&&(n<PDBp[4].length)) {chk=1;}
	}
	//อ.วิสุทธิ.
	else if 	(n1==5) {
	if ((col=="50")&&(n<PDBp[5].length)) { 	chk=1; 	} 	else	if ((col=="51")&&( n<=4)) { 	chk=1; 	} 	else	if ((col=="52")&&(n>=5 && n<=9)) { 	chk=1; 	} 	}
	//อภิธมฺมสงฺคห อ.-ฏี.
	else if 	(n1==6) {
	if ((col=="60")&&(n<PDBp[6].length)) {chk=1;}
	}
	else if (n1==8) {
	//จุฬาแปล
	if ((col=="80")&&(n<PDBp[8].length)) { 	chk=1; 	} 	else	if ((col=="81")&&( n<=8)) { 	chk=1; 	} 	else	if ((col=="82")&&(n>=9 && n<=33)) { 	chk=1; 	} 	else	if ((col=="82222")&&(n>=9 && n<=24)) { 	chk=1; 	} 	else	if ((col=="821")&&(n>=9 && n<=11)) { 	chk=1; 	} 	else	if ((col=="822")&&(n>=12 && n<=14)) { 	chk=1; 	} 	else	if ((col=="823")&&(n>=15 && n<=19)) { 	chk=1; 	} 	else	if ((col=="824")&&(n>=20 && n<=24)) { 	chk=1; 	} 	else	if ((col=="825")&&(n>=25 && n<=33)) { 	chk=1; 	} 	else	if ((col=="8255")&&(n>=29 && n<=31)) { 	chk=1; 	} 	else	if ((col=="83")&&(n>=34 && n<=45)) { 	chk=1; 	} 	}

	else if (n1==9) {
	//อ. จุฬาแปล
	if ((col=="90")&&((n>=7 && n<=10)||(n>=16 && n<=18))) { 	chk=1; 	} 	if ((col=="922")&&(n>=7 && n<=10)) { 	chk=1; 	} 	if ((col=="924")&&(n>=16 && n<=18)) { 	chk=1; 	} 	}
	//ฏีกาของอรรถกถาพระไตรปิฎก
	 else if 	(n1==10) { 	 	 	if ((col=="30")&&( n<=n<PDBp[3].length)) { 	chk=1; 	} 	else	if ((col=="31")&&( n<=7)) { 	chk=1; 	} 	else	if ((col=="32")&&(n>=8 && n<=28)) { 	chk=1; 	} 	else	if ((col=="32222")&&(n>=8 && n<=24)) { 	chk=1; 	} 	else	if ((col=="321")&&(n>=8 && n<=12)) { 	chk=1; 	} 	else	if ((col=="322")&&(n>=13 && n<=16)) { 	chk=1; 	} 	else	if ((col=="323")&&(n>=17 && n<=21)) { 	chk=1; 	}
	//อํ.ฏี.
	else	if ((col=="324")&&(n>=22 && n<=24)) {chk=1;}
	//ชา.ฏี.
	else	if ((col=="3254")&&(n>=25 && n<=28)) {chk=1;}
	//อภิ.มู-อนุฏี.
	else	if ((col=="33")&&(n>=29 && n<=34)) {chk=1;}
	}
	//วินยสงฺคห อ.-ฏี.
	else if 	(n1==11) {
	if ((col=="40")&&(n<PDBp[4].length)) {chk=1;}
	}
	//อ.วิสุทธิ.
	else if 	(n1==12) {
	if ((col=="50")&&(n<PDBp[5].length)) { 	chk=1; 	} 	else	if ((col=="51")&&( n<=4)) { 	chk=1; 	} 	else	if ((col=="52")&&(n>=5 && n<=9)) { 	chk=1; 	} 	}
	//อภิธมฺมสงฺคห อ.-ฏี.
	else if 	(n1==13) {
	if ((col=="60")&&(n<PDBp[6].length)) {chk=1;}
	}

	if (chk==1){ chk=" checked=checked "; }
 	else{ chk=" "; }
	var plus = new RegExp("\\+");
	str=str+chk+" >"+PDBp[n1][n]+"<br></font></label></td></tr>";
	str=str.replace(/\+/,", และ ");

}
	str=str+"</table></div>";
}
	var tid=document.getElementById("divx");
	if (tid!=null){tid.innerHTML= str ;}
}

function load(take) {
	var puts;
	var tid=document.getElementById("load");
	switch (take){
		case '1': puts="<table><tr><td background=images/bg.png align=center>กำลังดำเนินการ กรุณารอสักครู่...<br><img border=no src=images/loading.gif ><br>อิมสฺมึ กาเล โข สเตมี กมฺมํ อนุปุพฺพาย ปฏิปทาย กโรติ...<br><a href=# onclick=load('0'); >(close)</a></td></tr></table>";break;
		case '0': puts="";break;
	}
	if (tid!=null){tid.innerHTML=puts;}
}

//ใส่ตัวเลือกขนาดที่จะตัด
function CutLine() {
	var tag="Option";
	var tid=document.getElementById(tag);
	if (tid!=null){
		if (document.getElementById("subS").value>1){
			var insert="<span class=body> น.<input type=textbox name=cutBe size=1 value=15> ล.<input type=textbox name=cutAf size=1 value=20></span>";
			tid.innerHTML =insert;
		}
		else {
			tid.innerHTML ="<input type=hidden name=cutBe value=15> <input type=hidden name=cutAf value=20>";
		}
	}
}

//ตรวจสอบข้อความที่จะค้นว่ากรอกครบหรือไม่
function check(select){
var co=0;
var inp=document.form1.getElementsByTagName("input");
	for (var i2=0;i2<inp.length ;i2++ ){
		if (inp[i2].checked==true){
			var che="yes";
			break;
		}
}
	var v1 = document.getElementById("form1").search;
	var put="<span class=body>";
		if (v1.value.length <= 3){
			put=put+"คำค้นต้องมี 4 ตัวอักษรขึ้นไป. ";
			document.getElementById("load").innerHTML=put+"</span>";
			return false;
		} 
		else if (che!='yes' && select== "1"){
			put=put+" ท่านยังไม่ได้เลือกเล่ม.";
			document.getElementById("load").innerHTML=put+"</span>";
			return false;
		}
	else {return true;}
}

//กลุ่มของหน้าค้นบาลี
function PGroup() {
var PGroup = "0>เลือกกลุ่มเล่มที่ต้องการค้น,123321>สพฺพํปกรณํ,00100>สพฺพวินยปิฏก-อฏฺฐกถา-ฏีกา,00200>สพฺพสุตฺตนฺตปิฏก-อฏฺฐกถา-ฏีกา,00300>สพฺพอภิธมฺมปิฏก-อฏฺฐกถา-ฏีกา,00400>สพฺพลกฺขณ-อฏฺฐกถา-ฏีกา,10>+++เตปิฎก+++,11>+วินยปิฏก+,12>+สุตฺตนฺตปิฏก+,13>+อภิธมฺมปิฏก+,12222>+ปุริมจตุนิกาย(อญฺญตรขุทฺทกนิกาโย)+,121>*ทีฆนิกาย,122>*มชฺฌิมนิกาย,123>*สํยุตฺตนิกาย,124>*องฺคุตฺตรนิกาย,125>*ขุทฺทกนิกาย,1255>*นิทฺเทส-ปฏิสมฺภิทามคฺค(สาริปุตฺตเถเรนรจิโต),20>+เตปิฏก-อฏฺฐกถา+,21>+วินย-อฏฺฐกถา+,22>+สุตฺตนฺต-อฏฺฐกถา+,23>+อภิธมฺม-อฏฺฐกถา+,22222>ปุริมจตุนิกาย(อญฺญตรขุทฺทกนิกาโย),221>*อ.ทีฆนิกาย,222>*อ.มชฺฌิมนิกาย,223>*อ.สงฺยุตฺตนิกาย,224>*อ.องฺคุตฺตรนิกาย,225>*อ.ขุทฺทกนิกาย,2251>*อ.ธมฺมปท,2252>*อ.ขุทฺทกปาฐ-อุทาน-อิติวุตฺตก-สุตฺตนิปาต,2253>*อ.วิมาน-เปตวตฺถุ,2254>*อ.ชาตก,2255>*อ.นิทฺเทส-ปฏิสมฺภิทามคฺค,2256>*อ.เถร-เถริคาถา-อปทาน-พุทธวงฺส-จริยาปิฏก(biography),30>+++เตปิฏกฏฺฐกถายฏีกา+++,31>+วินย-ฏีกา+,32>+สุตฺตนฺต-ฏีกา+,33>+อภิธมฺม-ฏีกา+,32222>ปุริมจตุนิกาย(อญฺญตรขุทฺทกนิกาโย),321>*ฏี.ทีฆนิกาย,322>*ฏี.มชฺฌิมนิกาย,323>*ฏี.สงฺยุตฺตนิกาย,324>*ฏี.องฺคุตฺตรนิกาย,3254>*ฏี.ชาตก(เอกก-ทุกฺก-ติกฺก-จตุกฺก-ปญฺจก-ฉกฺกนิปาต),40>+++วินยลกฺขณ-อฏฺฐกถา-ฏีกา+++,50>+++สุตฺตนฺตลกฺขณ-อฏฺฐกถา-ฏีกา+++,51>*เนตติปกรณ์ปาฬิ-อรรถกถา-ฏีกา-วิภาวินีฏีกา,52>*วิสุทธิมรรค-อฏฺฐกถา-มหาฏีกา-นิทาน,60>+++อภิธมฺมลกฺขณ-อฏฺฐกถา-ฏีกา+++,80>+++พระไตรปิฎกแปล+++,81>+พระวินัย+,82>+พระสูตร+,83>+พระอภิธรรม+,82222>+พระสูตร๔นิกายแรก+,821>*ทีฆนิกาย,822>*มัชฌิมนิกาย,823>*สังยุตตนิกาย,824>*อังคุตตรนิกาย,825>*ขุททกนิกาย,8255>*นิทฺเทส-ปฏิสัมภิทามคฺค(ผลงานของพระสารีบุตร),90>+++อรรถกถาพระไตรปิฎก2นิกายแปล+++,922>*อ.มัชฌิมนิกาย,924>*อ.อังคุตตรนิกาย";
PGroup=PGroup.split(",");
var puts=puts+"<a><select name=col onChange=load('1');ChkB(PDBp,this.options[this.selectedIndex].value); onmouseover=langs('deBookSelectForm')>";
	for (i=0; i<PGroup.length;i++){
		PGroup[i]=PGroup[i].split(">");
		puts=puts+"<option value="+PGroup[i][0]+">"+PGroup[i][1]+"</option>";
	}
if (document.getElementById("PGroup")!=null) {document.getElementById("PGroup").innerHTML=puts+"</select><span id=deBookSelectForm></span></a>";}
}

function BookList(n1,DB) {
	var puts,start,stop,select;
	if (DB==TDBn) { select="TTitleContent"; switch (n1){ case 1 :start=1;stop=11;break; case 2 :start=11;stop=75;break; case 3 :start=75;stop=92;break; case 'O' :start=92;stop=TDBn.length;break;} } else {select="PTitleContent"; start=1;stop=DB.length;}
			puts="<table ><tr ><td ><ol>";
			for (var n=start;n<stop;n++) {
					if (start<92){
						puts= puts+"<li><a href=# onclick=\"load('1');load('1');Ajax('div1','n1="+n1+"&n="+n+"&OMode=Co&select="+select+"')\">"+DB[n]+"</a></li>";
					}
					else { puts= puts+"<li><a href=index.php?OMode=TRMain&DB="+n+"&search=No&pg=1 ><b>"+DB[n]+"</b></a></li>";}
			}
			
			puts= puts+"</ol></td></tr></table>";
			document.getElementById("div1").innerHTML=puts;
}

//สำหรับดิคและพวกที่เลื่อนตามสกอร์
window.onscroll = function () {
	var tag=document.getElementById("load");
	if (tag!=null) tag.style.top = document.body.scrollTop+200;
}

//เกี่ยวกับ dict
function SelectIt(Selectnum) {
var SelectIt;
var sDictO="<a href=# onclick=SelectIt('0'); ><-เลือกพจนานุกรม-|</a> : ";
	switch (Selectnum) { 
		case '1':SelectIt=sDictO+"<a href=# onclick=DictGloss('sadda','0','1'); >ประมวลศัพท์</a> | <a href=# onclick=DictGloss('dhamma','0','1'); >ประมวลธรรมไทย-ไทย</a> | <a href=# onclick=DictGloss('the','0','1'); >ประมวลธรรมไทย-อังกฤษ</a> | <a href=# onclick=DictGloss('eth','0','2'); >ประมวลธรรมอังกฤษ-ไทย</a>";break;
		case '2':SelectIt=sDictO+"<a href=# onclick=DictGloss('interPTE','0','1'); >บาลี-ไทย-อังกฤษ</a> | <a href=# onclick=DictGloss('interTEP','0','1'); >ไทย-อังกฤษ-บาลี</a> | <a href=# onclick=DictGloss('interEP','0','2'); >อังกฤษ-บาลี(โรมัน)</a> | <a href=# onclick=DictGloss('interPE','0','1'); >บาลี-อังกฤษ</a>";break;
		case '3':SelectIt=sDictO+"<a href=# onclick=DictGloss('interETTE','1','1'); >ไทย-อังกฤษ</a> | <a href=# onclick=DictGloss('interETTE','0','2'); >อังกฤษ-ไทย</a>";break;
		default :SelectIt="<a href=# onclick=SelectIt('1'); >พจนานุกรมพุทธศาสน์</a> | <a href=# onclick=SelectIt('2'); >พจนานุกรมภาษาบาลี</a> | <a href=# onclick=SelectIt('3'); >พจนานุกรมภาษาอังกฤษ</a>";break;
	}
	document.getElementById("SelectIt").innerHTML="<div align=center ><table><tr bgcolor=#f0f0f1><td><font size=4> "+SelectIt+"</font></td></tr></table></div>";
}

function DictGloss(dictDB,selectColumn,dictLang) {
	var submenu="";
	if (dictLang==1){
		var sub1=new Array("ก" , "ข" , "ค" , "จ" , "ฉ" , "ช" , "ฌ" , "ญ" , "ฏ" , "ฐ" , "ฑ" , "ฒ" , "ณ" , "ต" , "ถ" , "ท" , "ธ" , "น" , "ป" , "ผ" , "พ" , "ภ" , "ม" , "ย" , "ร" , "ล" , "ว" , "ส" , "ห" , "อ" , "เ","แ" ,"โ","ไ" ,"ใ" ,"a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z");
		var sub1num= new Array('161', '162', '164', '168', '169', '170', '172', '173', '175', '176', '177', '178', '179', '181', '182', '183', '184', '185', '187', '188', '190', '192', '193', '194', '195', '197', '199', '202', '203', '205', '224', '225', '226', '228', '227', '97', '98', '99', '100', '101', '102', '103', '104', '105', '106', '107', '108', '109', '110', '111', '112', '113', '114', '115', '116', '117', '118', '119', '120', '121', '122');
	}
	if (dictLang==2){
		var sub1=new Array("a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z");
		var sub1num=new Array('97','98','99','100','101','102','103','104','105','106','107','108','109','110','111','112','113','114','115','116','117','118','119','120','121','122');
	}
	for (var i1=0;i1<sub1.length ;i1++ ) {
		if (i1>0){submenu=submenu+" | ";}
		submenu=submenu+"<a href=# onclick=load('1');Ajax('dictSub','OMode=DictC&callTo=RunDictIndex&bdr=off&work=list100&dictDB="+dictDB+"&head="+sub1num[i1]+"&selectColumn="+selectColumn+"') >"+sub1[i1]+"</a>";
	}
	document.getElementById("submenu").innerHTML="<div align=center ><table><tr bgcolor=#F6FAF7><td align=center><font size=4>"+submenu+"</font></td></tr></table></div>";
}

//สำหรับ sssearch
function SSSend () {
	var pu;
	var get =document.getElementById('search1').value;
	var getn1 =document.getElementById('n11').value;
	pu="OMode=PSearch&SSKey=on&c[1]=1&c[2]=2&c[3]=3&c[4]=4&c[5]=5&c[6]=6&search="+get+"&n1="+getn1;
	return pu;
}